{
    "Affliction's Antiphon": {
        "faction": "Any",
        "internalID": "AfflictionsAntiphon",
        "branch": "Voice",
        "description": null,
        "flavor": "Listen to enough Voice cultists singing the Hymn of Decay and you'll hear the ones who've sung it the longest—who could infuse it with true emotion. That emotion was always despair. It seeped into the terrain where the Hymn was heard and could deaden the spirits of soldiers even after the singer was long gone.",
        "tier": "3",
        "requiredUpgrades": [
            "VoiceOperations"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\AfflictionsAntiphon.png",
        "name": "Affliction's Antiphon"
    },
    "Shield of the Speaker": {
        "faction": "Untold Prophet",
        "internalID": "ArmorOfFaithUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The war dragged on. The Prophet stretched the power of mystical invulnerability to its limits. One day demanded we bring him a forge. Publicly marked himself with a brand that looked like a pair of lips surrounding each eye. Through all the pain, never even whimpered. Afterwards, even more of his followers carried that invulnerable belief.",
        "tier": "8",
        "requiredUpgrades": [
            "ArmorOfFaith"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\ArmorOfFaithUpgrade.png",
        "name": "Shield of the Speaker"
    },
    "Overseer's Override": {
        "faction": "Heartless Artificer",
        "internalID": "ArtificersPrecisionUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Artificer began to see more value in the weapons than the people who carried them. She stopped trying to train better soldiers, and eventually built systems that would ensure every firearm, energy weapon, and missile silo could fire on her precise command.",
        "tier": "8",
        "requiredUpgrades": [
            "ArtificersPrecision"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\ArtificersPrecisionUpgrade.png",
        "name": "Overseer's Override"
    },
    "Asset Stripping": {
        "faction": "Any",
        "internalID": "AssetStripping",
        "branch": "Human",
        "description": null,
        "flavor": "One day, mining supervisors rolled up with new orders: “don’t just pull metal out of the earth, scrape it off junk from the battlefield. Oh and by the way, delivery quotas are going up.” Assholes.",
        "tier": "5",
        "requiredUpgrades": [
            "LogisticsExperts"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\AssetStripping.png",
        "name": "Asset Stripping"
    },
    "Atramentous Echoes": {
        "faction": "Any",
        "internalID": "AtramentousEchoes",
        "branch": "Voice",
        "description": null,
        "flavor": "We'd grown used to the Aura. Iridescent ripple. Nerves light up. Heart races faster. And this time—my skin literally hardened. Caught a bullet right after the Aura took effect and it just bounced off me. Poor bastard who pulled the trigger had the best look on his face. Like he knew a monster was about to tear him to shreds.",
        "tier": "8",
        "requiredUpgrades": [
            "AtramentousAura"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\AtramentousEchoes.png",
        "name": "Atramentous Echoes"
    },
    "Ingestible Augments": {
        "faction": "Rogue Operative",
        "internalID": "AugmentsUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Installing augments took time. Time we were starting to run out of. The Operative threw a fit, said we should just start feeding augments to troops to get them installed faster. One engineer didn't know she was joking. They went off… cooked up pill-sized drones that could build and install augments through the bloodstream. Kid went white as a sheet when I explained they weren't supposed to take the Operative literally. Good thing they did though…",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\AugmentsUpgrade.png",
        "name": "Ingestible Augments"
    },
    "ICAR Blueprints": {
        "faction": "Rogue Operative",
        "internalID": "AugmentsUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "“MotherFUCKERS” the boss shouted, storming into the command center. When the Rogue Operative yelled she could make a room of killers and geniuses jump. “Knew it. Fucking ICAR fucking left junk code in augment designs. Fucking sold people the fix fucking assholes fuck.” She had the fix now but this sin by ICAR… it seemed personal for her.",
        "tier": "9",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\AugmentsUpgrade2.png",
        "name": "ICAR Blueprints"
    },
    "Bleed Cultivation": {
        "faction": "Any",
        "internalID": "BleedCultivation",
        "branch": "Voice",
        "description": "Removes negative effects of Bleed in your cities\nAllows building placement on Bleed in your cities\nAllows Construction Yard to create Bleed",
        "flavor": "The Voice's whispers twisted our senses and our minds. One day everyone woke up and the alien plants of the Bleed smelled like honeysuckle. Our people wanted it to grow in their homes and bathe in its stench. I held it off, and watched our cities morph into twisted towers that could have come from another planet…",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\BleedCultivation.png",
        "name": "Bleed Cultivation"
    },
    "Bunker": {
        "faction": "Any",
        "internalID": "Bunker",
        "branch": "Human",
        "description": null,
        "flavor": null,
        "tier": "4",
        "requiredUpgrades": [
            "Engineer"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\Bunker.png",
        "name": "Bunker"
    },
    "Combat Drones": {
        "faction": "Any",
        "internalID": "CombatDrone",
        "branch": "Cyber",
        "description": null,
        "flavor": null,
        "tier": "4",
        "requiredUpgrades": [
            "ChayotExterminator"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\CombatDrone.png",
        "name": "Combat Drones"
    },
    "Premium Access": {
        "faction": "Any",
        "internalID": "ConcordatAdvancedResources",
        "branch": "Neutral",
        "description": "Unlocks buying and selling of <nbsp/>Transuranium, <nbsp/>Antimatter, <nbsp/>Dimensional Echoes and <nbsp/>Singularity Cores at the Concordat.",
        "flavor": "To access the Concordat’s best caches–the stuff they had locked away in hidden cells and bunkers—you had to prove yourself. Prove your loyalty. Send a few “volunteer” scientists with nothing to live for, to show you’d sacrifice your best to whatever the Concordat was. And never, NEVER, ask what happens to them.",
        "tier": "5",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\ConcordatAdvancedResources.png",
        "name": "Premium Access"
    },
    "Acts of Piety": {
        "faction": "Untold Prophet",
        "internalID": "CostOfConvictionUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The kid—the child, the Prophet, whatever you called him—figured it out. Brought his followers out of their shells and into his fold. He took time out of his day to visit the people, bless them, and listen to their woes. Was it an act? Was it sincere? Or did he just ride the fine line between both?",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\CostOfConvictionUpgrade.png",
        "name": "Acts of Piety"
    },
    "Mass Movement": {
        "faction": "Untold Prophet",
        "internalID": "CostOfConvictionUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Believers hiding out in caves, that's a cult. They fill their own quarter of a city, that's a religion. But when they fill the streets, drowning in each other's energy and screaming to the heavens—that's… God. That's a force of nature. If you aren't in on it, you'll feel like you're caught in a massive storm.",
        "tier": "6",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\CostOfConvictionUpgrade2.png",
        "name": "Mass Movement"
    },
    "Crypto Fetters": {
        "faction": "Any",
        "internalID": "CryptoFetters",
        "branch": "Cyber",
        "description": null,
        "flavor": "The programmer who cooked up this little worm was beaming with pride. Talked about slowing enemy machines by having them solve complex puzzles to execute simple tasks. I asked why no one else had designed a virus like this. “It's the same problem I have,” he replied, fidgeting with a small coin as we spoke. “No one thinks like I do. Not even ZEPHON.”",
        "tier": "3",
        "requiredUpgrades": [
            "CyberOperations"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\CryptoFetters.png",
        "name": "Crypto Fetters"
    },
    "Mission Stations": {
        "faction": "Untold Prophet",
        "internalID": "CultExpansionUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Oldest tool in the handbook of any Empire: the church. Sending in priests was just the start. Give the priests homes and shelter to preach in and you can attract true interest in your cause. Under the Prophet's eye those who become believers, become fanatics, become zealots—ready to piss and shit blood for his bloody crusade.",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\CultExpansionUpgrade.png",
        "name": "Mission Stations"
    },
    "The Global Logos": {
        "faction": "Untold Prophet",
        "internalID": "CultExpansionUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Nonbelievers would eventually side with the Prophet too. Not through fear or intimidation but through that kind of casual faith we all keep so we don't feel like we're picking the wrong team. They'd say to each other they didn't believe in The Great Speaker—and then, whisper prayers to him in the seconds before bullets started flying.",
        "tier": "9",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\CultExpansionUpgrade2.png",
        "name": "The Global Logos"
    },
    "Shared Vision": {
        "faction": "Furtive Tribunal",
        "internalID": "DarkOmenUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "“I think we're being watched”—a terrifying enough phrase if you thought the Tribunal was spying on you. But in time, it took on a new edge. Their gaze became something you felt in the air. But the Voice's gaze—you felt it in your bones. You knew it saw right through you. You knew it was divining the perfect way that you could be broken.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\DarkOmenUpgrade.png",
        "name": "Shared Vision"
    },
    "Blindsight": {
        "faction": "Furtive Tribunal",
        "internalID": "DarkOmenUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "One of the many rumors about the Acrin was that they'd never invented any form of telescope—that their priests could call on The Voice to see across great distances, even as far as other worlds. Maybe that explained the growing gaze of the Furtive Tribunal, and how the three mystics could see further and further beyond their walls with each passing year.",
        "tier": "6",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\DarkOmenUpgrade2.png",
        "name": "Blindsight"
    },
    "Asset Diversion": {
        "faction": "Emulated Mind",
        "internalID": "DataHackUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Skimming off the top of her enemy's resource lines? No computer would think of that. The more you looked for artificial intelligence creeping into the Emulated Mind's actions—the more likely you were to find that human spark fighting to survive.",
        "tier": "8",
        "requiredUpgrades": [
            "DataHack"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\DataHackUpgrade.png",
        "name": "Asset Diversion"
    },
    "Dread Shadow": {
        "faction": "Any",
        "internalID": "DreadShadow",
        "branch": "Voice",
        "description": null,
        "flavor": "Shadows. They were just shadows all along. Light bent to… do something, Christ. If one of the doubles slashed at your arm, it was still the claw of the original Hunter cutting into your flesh. Had to keep shooting. Just had to keep shooting and hope your futuristic energy gun could do something against a monster that could fuck with light itself.",
        "tier": "7",
        "requiredUpgrades": [
            "PhenarisHunter"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\DreadShadow.png",
        "name": "Dread Shadow"
    },
    "EMP Drones": {
        "faction": "Any",
        "internalID": "EMPDrone",
        "branch": "Cyber",
        "description": null,
        "flavor": null,
        "tier": "7",
        "requiredUpgrades": [
            "CyberAircraft"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\EMPDrone.png",
        "name": "EMP Drones"
    },
    "Reticule Drift": {
        "faction": "Emulated Mind",
        "internalID": "EmulatedMindAffinityUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "“J-j-j-ust NUDGE. NUDGE. NUDGE their targeting a few few degrees off off off nudge nudge CHANGE the flow of a r.i.v.e.r by inches and downstream it will shift by MILES. EARTH has no accuracy only WEAPONS do weapons made by men, made by minds, a nudge is only a nudge if a mind can interpret that a change has occurred.” — Interference Protocols update log 1.888",
        "tier": "5",
        "requiredUpgrades": [
            "CyberOperations"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\EmulatedMindAffinityUpgrade.png",
        "name": "Reticule Drift"
    },
    "Twisted Bounty": {
        "faction": "Heartless Artificer",
        "internalID": "EngineerLifeUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Artificer attracted followers with a promise: with her knowledge, she said she could ensure all their children would grow up safe and healthy, free of the new world's diseases. But such safety came with a price. Every child born under her watch… was a child she would not hesitate to experiment on if she saw the need.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\EngineerLifeUpgrade.png",
        "name": "Twisted Bounty"
    },
    "Fertile Waters": {
        "faction": "Heartless Artificer",
        "internalID": "EngineerLifeUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Artificer could control how her people bred but she couldn't make them breed. I thought even that power was beyond her. It wasn't. She seeded bioengineered fertility drugs in the water supply. Any sexual encounter—even with protection—could turn a person of any gender into a factory for genetic material. Vile. Monstrous. She took away one of the most personal choices a person can make.",
        "tier": "6",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\EngineerLifeUpgrade2.png",
        "name": "Fertile Waters"
    },
    "Expedition Outfitter": {
        "faction": "Any",
        "internalID": "Exploration",
        "branch": "Neutral",
        "description": null,
        "flavor": "Scouts would come back to camp with stories of the strange buildings now out in the wastes—stories that would get out to civilians and troops defending the home base. We worried they'd spread fear, but instead we got—curiosity. People wanted to know about this brave new world. They wanted to find their place in it.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\Exploration.png",
        "name": "Expedition Outfitter"
    },
    "The Expendables": {
        "faction": "Heartless Artificer",
        "internalID": "FoundationOfBloodUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Revolts against the Artificer's rule took place on a regular basis. Workers would demand better treatment. She responded with the blades of Erelim Assassins. “Crackdowns do wonders for productivity,” she told me once. “You purge the bad workers, and new ones, desperate for work, gladly step into their place.”",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\FoundationOfBloodUpgrade.png",
        "name": "The Expendables"
    },
    "To The Bone": {
        "faction": "Heartless Artificer",
        "internalID": "FoundationOfBloodUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Artificer whittled away at every other human flaw that slowed her ambitions. Why not eliminate pain? At first the people loved her for it… until her workers realized they now had to work with holes in their guts and pieces of their scalp missing. So long as their muscles moved and their mind functioned, they were bound to work.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\FoundationOfBloodUpgrade2.png",
        "name": "To The Bone"
    },
    "Closer Together": {
        "faction": "Furtive Tribunal",
        "internalID": "FurtiveTribunalAffinityUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Those few survivors of the Hymn of Decay reported hearing… melodies as everything rotted. May have been their meds, but they swore the songs sounded like… like regular music. Choruses and three-chord progressions that could have popped out of an old radio. Had the Voice been with us for centuries, whispering to us through the throats of bards and artists alike?",
        "tier": "5",
        "requiredUpgrades": [
            "VoiceOperations"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\FurtiveTribunalAffinityUpgrade.png",
        "name": "Closer Together"
    },
    "Word of Mouth": {
        "faction": "Honorable Aristocrat",
        "internalID": "GluttonyUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Aristocrat's gamble paid off. Travelers spread tales of how well-nourished the people inside his walls were, and survivors flocked to his cities for a taste of real hand-crafted bread… and with coin to pay for it. He never let me live down the fact that I doubted him.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\GluttonyUpgrade.png",
        "name": "Word of Mouth"
    },
    "Famous Feasts": {
        "faction": "Honorable Aristocrat",
        "internalID": "GluttonyUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Aristocrat's cities became so densely populated that there wasn't any such thing as eating in isolation. Visiting a mess hall would bring you to a gathering of friends new and old, and on some days they grew to full-blown feasts spilling out into the street. The horrors of the world around us couldn't keep people's spirits down. Humanity wanted to thrive.",
        "tier": "6",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\GluttonyUpgrade2.png",
        "name": "Famous Feasts"
    },
    "Hardening Hearts": {
        "faction": "Practical Romantic",
        "internalID": "HeartfeltLossUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Warned the Romantic it would happen. There'd be a day when even he grew numb reading the names of the dead. He fought that instinct. Wanted to feel the passing of every soldier who died for his cause. But you just lose track. Everyone… everyone always loses track.",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\HeartfeltLossUpgrade.png",
        "name": "Hardening Hearts"
    },
    "Memories E'er More": {
        "faction": "Practical Romantic",
        "internalID": "HeartfeltLossUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Romantic really had been ready for this moment. Back in the bunker he'd found plans for tech that could extract memories from humans and wipe it from their minds. When the dead began to number in the millions, he rolled them out to the public. Promised they'd be there when the war was over. Then he made me haul the memory caches out to the desert and blow them sky-high, so he could blame it on our enemies.",
        "tier": "9",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\HeartfeltLossUpgrade2.png",
        "name": "Memories E'er More"
    },
    "Foreman Favors": {
        "faction": "Honorable Aristocrat",
        "internalID": "HiredHandsUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "“Plausible deniability”—the ugly side of the Honorable Aristocrat's vast network of favor-owing flunkeys. A sea of low-level gangsters lay hidden in the network who'd gladly whip workers into shape. However “honorable” the Aristocrat claimed to be—he always knew which side of the class war he was born on.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\HiredHandsUpgrade.png",
        "name": "Foreman Favors"
    },
    "Voluntary Crunch": {
        "faction": "Honorable Aristocrat",
        "internalID": "HiredHandsUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "“I have to pull extra hours, I'll let everyone down if I don't,” said the laborer at the watercooler. Another laborer approached. I asked why she was working so late. Said the same thing as the first. So did the third worker. And the fourth. And the fifth… all burning themselves away without a single overseer telling them to.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\HiredHandsUpgrade2.png",
        "name": "Voluntary Crunch"
    },
    "Hit, Then Run": {
        "faction": "Rogue Operative",
        "internalID": "HitAndRunUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Slip into the underground fight clubs and you could find the Rogue Operative, in disguise, shirking her duties as a leader to scrap it up with the city's fighters. She learned down there. Learned that if you threw a hit and then moved, you had that strong stance, that stable shot—the power to strike a knockout blow merely by standing your ground.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\HitAndRunUpgrade.png",
        "name": "Hit, Then Run"
    },
    "ICAR Gunfight Repo": {
        "faction": "Rogue Operative",
        "internalID": "HitAndRunUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "You'd never catch me solving math problems on the battlefield. But the Operative wanted troops to react like ninjas. Updated everyone's augments one day with predictive software trained on thousands of recorded gunfights. When it worked, you could see five seconds into the future every time you pulled the trigger. When it didn't… well. “User error,” she'd like to say.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\HitAndRunUpgrade2.png",
        "name": "ICAR Gunfight Repo"
    },
    "Deeper Ties": {
        "faction": "Honorable Aristocrat",
        "internalID": "HonorboundUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "“It's foundational economic theory that nations that make strong economic ties with one another have too much to lose to ever wage war!” the Aristocrat insisted. He didn't want to hear arguments *again* about how all economic theory was written before towering titans of flesh and metal walked across the planet.",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\HonorboundUpgrade.png",
        "name": "Deeper Ties"
    },
    "Wealth of Nations": {
        "faction": "Honorable Aristocrat",
        "internalID": "HonorboundUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Aristocrat could spice up any deal with a dozen sub-clauses and bonus agreements. “Buy a shipment of food, get extra pallets of ammo as a bonus, and the ammo counts to the deductible insurance…” He could have spun those contracts to be so exploitative, but really did want the best outcome for everyone. Naive fool. The second someone didn't want to play his accounting games he would be in for a world of hurt.",
        "tier": "9",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\HonorboundUpgrade2.png",
        "name": "Wealth of Nations"
    },
    "Horizon Expansion": {
        "faction": "Any",
        "internalID": "HorizonExpansion",
        "branch": "Cyber",
        "description": null,
        "flavor": "“Expansion.” They were already so proud of themselves for conjuring black holes on Earth and now they wanted to “expand the event horizons.” They weren't expanding anything. They were pulling us closer to the end of the universe itself.",
        "tier": "8",
        "requiredUpgrades": [
            "BlackHole"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\HorizonExpansion.png",
        "name": "Horizon Expansion"
    },
    "Leaden Rain": {
        "faction": "Rogue Operative",
        "internalID": "IcarusSatelliteUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Boss was like a kid in a candy store when she learned ICAR Corp had been experimenting with railguns in its Icarus Satellite Network. “Metal rod? Down from sky? YES! NOW.” I swear that woman was feral. “Like ScreamTroopers 5, loved that game. I LOVED. That game.”",
        "tier": "8",
        "requiredUpgrades": [
            "IcarusSatellite"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\IcarusSatelliteUpgrade.png",
        "name": "Leaden Rain"
    },
    "Infant Inculcation": {
        "faction": "Heartless Artificer",
        "internalID": "ImmoralUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Artificer had a fixation on children. Survivors came to her with their own preconceptions of the world but children… children could be shaped. Molded. Convinced that they were worth less than nothing. And when they grew old and the stubborn ones dared to resist her—she had millions of drones too suppressed to join the uprising.",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\ImmoralUpgrade.png",
        "name": "Infant Inculcation"
    },
    "Social Credit": {
        "faction": "Heartless Artificer",
        "internalID": "ImmoralUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Drugged, dazed, and controlled, some civilians in the Artificer's cities still struggled under her grip. So she loosened it. She implemented a social credit policy inspired by Old World tyrants. Stay in line, your number went up. Resist… and your number dropped, along with the number of anyone you were close to. No violence needed. All your remaining friends and family became the force that kept you in line.",
        "tier": "9",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\ImmoralUpgrade2.png",
        "name": "Social Credit"
    },
    "Small Scale Op": {
        "faction": "Rogue Operative",
        "internalID": "IndependentUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Rogue Operative brought megacorporations to their knees with a small crew and some savvy social engineering. She never felt the need to run a proper gang, always wanted that close, trusted circle. If she kept things tight, no one could slip a knife in between her ribs.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\IndependentUpgrade.png",
        "name": "Small Scale Op"
    },
    "Comprehensive Connexion": {
        "faction": "Rogue Operative",
        "internalID": "IndependentUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Ever the counterculture obsessed hacker. The Rogue Operative would only sign off on expanding the population if she could stick an “X” in the policy name. Maybe more leaders should let their inner children run wild. Maybe too many already do…",
        "tier": "6",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\IndependentUpgrade2.png",
        "name": "Comprehensive Connexion"
    },
    "Salvation Protocols": {
        "faction": "Fallen Soldier",
        "internalID": "LeaveNoManBehindUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "“Salvation Protocols”—that was the Fallen Soldier's name for the creation of a corps of sanctioned scavengers who joined each unit on the battlefield. They'd keep their distance, never raising a weapon or rushing in to render aid. Only after the combatants withdrew would they rush in, recovering equipment and pulling mangled survivors out of the dirt.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\LeaveNoManBehindUpgrade.png",
        "name": "Salvation Protocols"
    },
    "Rapid Extraction": {
        "faction": "Fallen Soldier",
        "internalID": "LeaveNoManBehindUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Keeping Salvation Protocols in effect drained our resources bad. Fallen Soldier still wouldn't sacrifice a single soldier. Idealistic fool. But a smart fool. He trained us for rapid exfiltration operations. “Get in, get out, get paid” became the new model.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\LeaveNoManBehindUpgrade2.png",
        "name": "Rapid Extraction"
    },
    "Comprador Science": {
        "faction": "Furtive Tribunal",
        "internalID": "MysticismUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Many surviving scientists ran from the Tribunal in fear. But some drifted toward them in awe. They sought one who would permit their most tortured experiments—who ignored any need for ethics or reliability. They wanted to play God—and found a God ready to share its playground.",
        "tier": "4",
        "requiredUpgrades": [
            "Influence"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\MysticismUpgrade.png",
        "name": "Comprador Science"
    },
    "Scimystic Scismatics": {
        "faction": "Furtive Tribunal",
        "internalID": "MysticismUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "At dawn, we found the body of a scientist collapsed in a Research Laboratory. One death would have meant nothing if the Tribunal themselves hadn't swooped in to see the body. “He saw it,” the First of the Three whispered. “He spoke with it,” scribbled the Second. The Third merely drew a knife and sliced the lips off the dead man's mouth.",
        "tier": "9",
        "requiredUpgrades": [
            "Influence"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\MysticismUpgrade2.png",
        "name": "Scimystic Scismatics"
    },
    "Numinous Reveries": {
        "faction": "Any",
        "internalID": "NuminousReveries",
        "branch": "Voice",
        "description": null,
        "flavor": "The juices that poured out of bodies blown up by Voice commanders could be chemically altered to stick to the skin. Didn't hurt that much. But you know what did? Having your eyelids fused shut on the battlefield at the worst possible moment.",
        "tier": "5",
        "requiredUpgrades": [
            "Apotheosis"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\NuminousReveries.png",
        "name": "Numinous Reveries"
    },
    "Clandestine Cartel": {
        "faction": "Honorable Aristocrat",
        "internalID": "QuidProQuoUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "If there was anyone who could revive old-world corporate tricks, it was the Honorable Aristocrat. He went to great lengths to fool traders into sharing supplies more often. They'd think they were trading with different partners but it was just all his corps and agents, sometimes wearing literal masks to hide their identity…",
        "tier": "8",
        "requiredUpgrades": [
            "QuidProQuo"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\QuidProQuoUpgrade.png",
        "name": "Clandestine Cartel"
    },
    "Poetic Justice": {
        "faction": "Practical Romantic",
        "internalID": "ReallocateUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Practical Romantic was the only faction leader who would sit down with a soldier who wanted to stop fighting. Most would have just executed them or threw them in jail. He heard them out and explained how they could serve the war effort from the back lines. If they'd lost the will to live, he wanted them to have a path to get it back.",
        "tier": "8",
        "requiredUpgrades": [
            "Reallocate"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\ReallocateUpgrade.png",
        "name": "Poetic Justice"
    },
    "Perfect Logistics": {
        "faction": "Emulated Mind",
        "internalID": "ResourceNetworkUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Many shrugged off The Emulated Mind's mastery of logistics as a side effect of her cybernetic condition. I don't think that was true. She had such a human touch at moving supply lines and ingesting resources. There was an understanding of human limits. In her old life—before the war—I think this was part of her job.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\ResourceNetworkUpgrade.png",
        "name": "Perfect Logistics"
    },
    "Routine Tasks": {
        "faction": "Emulated Mind",
        "internalID": "ResourceNetworkUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "A glitch in the Emulated Mind's programming risked driving her to hyperfocus on managing outpost extraction. If she wanted to protect her core functions she needed to dump that piece of her programming. She did—into a virtual clone of herself. Now it could manage outpost resources while she turned her full attention to the rest of the war.",
        "tier": "6",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\ResourceNetworkUpgrade2.png",
        "name": "Routine Tasks"
    },
    "Probe Reconditioning": {
        "faction": "Any",
        "internalID": "SatelliteScanUpgrade",
        "branch": "Human",
        "description": null,
        "flavor": "When a sleep-deprived specialist entered the wrong coordinates during a routine satellite sweep—a “constellation of probes” pinged her back. Acrin and human devices littered the solar system, all waiting for someone to just wake them up.",
        "tier": "3",
        "requiredUpgrades": [
            "HumanOperations"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\SatelliteScanUpgrade.png",
        "name": "Probe Reconditioning"
    },
    "Even The Obols": {
        "faction": "Practical Romantic",
        "internalID": "ScavengerUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "“Thought you were supposed to be the one with morals,” I said, watching the Romantic crack open a coffin. We'd holed in a graveyard. Needed fuel for a fire. “I am,” he replied, muttering something about how morals are meant to benefit the living. “The dead… the dead can't do anything with them, can they?”",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\ScavengerUpgrade.png",
        "name": "Even The Obols"
    },
    "Sweet Bones of My Kin": {
        "faction": "Practical Romantic",
        "internalID": "ScavengerUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "I think the Romantic knew from the start he'd have to get even more… “Practical” than he anticipated. Had us distribute some scavenged tech to the troops one day. Pressurized canisters that broke matter down to raw materials—materials we needed to win the war. “Use it only on the dead or destroyed,” he warned. “Kill anyone with these and I'll exile you myself.”",
        "tier": "6",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\ScavengerUpgrade2.png",
        "name": "Sweet Bones of My Kin"
    },
    "Shoch'itris Lair": {
        "faction": "Any",
        "internalID": "ShochitrisLair",
        "branch": "Voice",
        "description": null,
        "flavor": null,
        "tier": "2",
        "requiredUpgrades": [
            "VoiceVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\ShochitrisLair.png",
        "name": "Shoch'itris Lair"
    },
    "Fervid Insights": {
        "faction": "Any",
        "internalID": "ShochitrisLairUpgrade",
        "branch": "Voice",
        "description": null,
        "flavor": "The cultists spent a week force-feeding the Shoch'itris a mix of alien spice and drugs looted from Old World bases. The white-and-red powder made boils grow on the surface of the skin and they spewed even more twisted Deformities out of their guts when we sent them to the battlefield.",
        "tier": "3",
        "requiredUpgrades": [
            "ShochitrisLair"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\ShochitrisLairUpgrade.png",
        "name": "Fervid Insights"
    },
    "Surthodai's Kiss": {
        "faction": "Any",
        "internalID": "SurthodaisKiss",
        "branch": "Voice",
        "description": null,
        "flavor": "She'd come to you in a dream. Lead you to her world. Look crushed when you told her you couldn't follow through the Bleed. “With a kiss, you can,” she'd say, and then press her lips to yours. The tendrils enter your mouth. You'd wake up—and the next day, walking through the Bleed would feel like her lesions still grazing your skin.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\SurthodaisKiss.png",
        "name": "Surthodai's Kiss"
    },
    "Simulation Capture": {
        "faction": "Fallen Soldier",
        "internalID": "SurvivalTrainingUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Fallen Soldier reviewed every after-action report and fretted over what he would have done if he'd been on the front line. That fretting grew into obsession, and he commissioned a combat simulator that would drill his followers into learning his every instinct. His every thought. As though they were all extensions of him…",
        "tier": "8",
        "requiredUpgrades": [
            "SurvivalTraining"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\SurvivalTrainingUpgrade.png",
        "name": "Simulation Capture"
    },
    "Tessera Core": {
        "faction": "Any",
        "internalID": "TesseraCore",
        "branch": "Cyber",
        "description": null,
        "flavor": null,
        "tier": "6",
        "requiredUpgrades": [
            "HashmallimHost"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\TesseraCore.png",
        "name": "Tessera Core"
    },
    "Modulated Harmony": {
        "faction": "Furtive Tribunal",
        "internalID": "TheOutsiderUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Tribunal summoned The Outsider with a chant. If the trio performed it right, the Voice's power would carry with them, and that foul beast from beyond time and space would be stronger—knowing its true master was watching over it.",
        "tier": "8",
        "requiredUpgrades": [
            "TheOutsider"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\TheOutsiderUpgrade.png",
        "name": "Modulated Harmony"
    },
    "The Thing With Feathers": {
        "faction": "Practical Romantic",
        "internalID": "ThereIsHopeUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Pinned down. Again. Bullet caught my cheek. Checked my pack for a bandage—pulled out a carved bird instead. The Romantic's symbol of hope… he must have slipped it in my pack. Felt something coming off it. No Voice magic, no AI bullshit, just a tchotchke the Romantic made with his bare hands. Pain faded a little. Just enough for me to grab my rifle and get back to the fight.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\ThereIsHopeUpgrade.png",
        "name": "The Thing With Feathers"
    },
    "Systematic Dreamers": {
        "faction": "Practical Romantic",
        "internalID": "ThereIsHopeUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Everyone was ordered to scratch the name down of someone they loved on a piece of tape. We put that tape on gear we'd grab in the middle of a firefight—magazines, medkits, repair pods, armor, you name it. You'd pick it up, see the name. Remember how much that person meant to you. Nothing could stop you when you were fighting for someone you loved.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\ThereIsHopeUpgrade2.png",
        "name": "Systematic Dreamers"
    },
    "The Final Bastion": {
        "faction": "Emulated Mind",
        "internalID": "TrappedUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Being trapped inside a single city drove The Emulated Mind to paranoia—but its massive walls gave her followers hope. They didn't fear the consequence of a single successful strike. Instead they thought they'd found a leader who'd do everything to protect them.",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\TrappedUpgrade.png",
        "name": "The Final Bastion"
    },
    "The Last Utopia": {
        "faction": "Emulated Mind",
        "internalID": "TrappedUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "“One City. One World. One People.” The Emulated Mind's new vision for humanity living all in one city hid a bitter truth: years of war had made her people as scared, fragmented, and paranoid as she was. But they told everyone else that they lived in the best place on Earth.",
        "tier": "9",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\TrappedUpgrade2.png",
        "name": "The Last Utopia"
    },
    "Tunneling Nails": {
        "faction": "Any",
        "internalID": "TunnelingNails",
        "branch": "Voice",
        "description": null,
        "flavor": "I did not know you could make the Voice's creations even more vile, but our seers found a way. They whispered their blessings onto these nails—like the ones they used to build railroads with—and stabbed them through the hands of the Aegyllan Worms. When I asked why the hell they thought this would work, they just smiled and explained it came to them all in a collective dream.",
        "tier": "3",
        "requiredUpgrades": [
            "AegyllanWorm"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\TunnelingNails.png",
        "name": "Tunneling Nails"
    },
    "Antigen Suppressants": {
        "faction": "Fallen Soldier",
        "internalID": "UndyingUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "As the war grew longer, those who carried the flesh of the Fallen Soldier found their bodies fighting against them. They were forced to suppress their immune systems and make their leader's flesh a part of their own. Their bodies became forever connected to his.",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\UndyingUpgrade.png",
        "name": "Antigen Suppressants"
    },
    "Rampant Replication": {
        "faction": "Fallen Soldier",
        "internalID": "UndyingUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "So that was the catch. The Fallen Soldier's flesh didn't just restore its carriers’ bodies. By war's end… well… it's like the good book said, “…God created mankind in his own image, in the image of God he created them.” Swap “God” for “the Fallen Soldier” and you'll see the problem we had.",
        "tier": "9",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\UndyingUpgrade2.png",
        "name": "Rampant Replication"
    },
    "Unrestrained Disassembly": {
        "faction": "Any",
        "internalID": "UnrestrainedDisassembly",
        "branch": "Cyber",
        "description": null,
        "flavor": "Fine, I admit it. The “antiparticle purge” was one of the best tools we had. It cleared up alien gunk, sucked up some much-needed energy, and with some extra tweaks, it could put the hurt down on any flesh-and-blood targets standing in the way. Old-world corpos were cruel—but we needed their cruelty.",
        "tier": "5",
        "requiredUpgrades": [
            "AntiparticlePurge"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\UnrestrainedDisassembly.png",
        "name": "Unrestrained Disassembly"
    },
    "Blind Devotion": {
        "faction": "Untold Prophet",
        "internalID": "UntoldProphetAffinityUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Patrol duty sometimes took me around the Sealed Hermitage. The Prophet needed their faith to flex his power on the battlefield. Fucking weird. Early years they'd be screaming to all the Voice gods. Never the Great Speaker. By the end that was the only name they'd cry out. And they sounded happy while doing it.",
        "tier": "10",
        "requiredUpgrades": [
            "AtramentousAura"
        ],
        "iconPath": "Zephon\\Icons\\Upgrades\\UntoldProphetAffinityUpgrade2.png",
        "name": "Blind Devotion"
    },
    "Designated Ingress": {
        "faction": "Furtive Tribunal",
        "internalID": "WhispersOfTheVoiceUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Triumvirate who made up the Tribunal had an uncanny eye for what research their scientists should pursue. Not because any of them knew the truths of science… but because the Voice showed them glimpses of a future that already took place.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\WhispersOfTheVoiceUpgrade.png",
        "name": "Designated Ingress"
    },
    "Mandated Compatibilism": {
        "faction": "Furtive Tribunal",
        "internalID": "WhispersOfTheVoiceUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Tribunal did not need anyone to “accept” that science and Voice-tainted mysticism worked in harmony, they simply mandated that they did. Science can only observe reality and if reality is bound to the will of the Voice… then there is nothing for scientists left to do but become priests.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\WhispersOfTheVoiceUpgrade2.png",
        "name": "Mandated Compatibilism"
    },
    "Fresh Orisons": {
        "faction": "Untold Prophet",
        "internalID": "WordsOfTheProphetUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Unreal. Walk the ranks of those who opposed the Untold Prophet and you'd still find some believers. His religion bled across borders through the words of heretics and exiles. Shook everyone up—soldiers everywhere were just more likely to switch sides if the Prophet whispered in their ear…",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\WordsOfTheProphetUpgrade.png",
        "name": "Fresh Orisons"
    },
    "Tetragrammatonic Texts": {
        "faction": "Untold Prophet",
        "internalID": "WordsOfTheProphetUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Someone—the Fallen Soldier maybe?—ordered the burning of the Prophet's texts and jailed anyone preaching the word of the Great Speaker on his territory. The kid thought quickly though. He sent out followers carrying books blessed by the Voice that would only reveal their words if the reader was ready for them. Lured in more believers and made it even easier to recruit them to the cause.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\WordsOfTheProphetUpgrade2.png",
        "name": "Tetragrammatonic Texts"
    },
    "Eventful Horizons": {
        "faction": "Emulated Mind",
        "internalID": "EmulatedMindAffinityUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Emulated Mind's core database contained exabytes of singularity research from Old World universities. When ZEPHON woke her up it literally birthed her with knowledge of black holes no one else could access… maybe the impossible calculations that could create an event horizon were what had first driven her so mad.",
        "tier": "10",
        "requiredUpgrades": [
            "BlackHole"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\EmulatedMindAffinityUpgrade2.png",
        "name": "Eventful Horizons"
    },
    "Toxic Spearhead": {
        "faction": "Any",
        "internalID": "ToxicSpearhead",
        "branch": "Voice",
        "description": null,
        "flavor": "Dragoons would drag their spears through the vile waste the Abkluth left behind after defecating. The tips of their weapons would then be coated in some of the most vile and dangerous substances ever exposed to human skin.",
        "tier": "1",
        "requiredUpgrades": [
            "VoiceInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\ToxicSpearhead.png",
        "name": "Toxic Spearhead"
    },
    "Old Painless": {
        "faction": "Fallen Soldier",
        "internalID": "FallenSoldierAffinityUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Watchmaker Yetunde delivered three code-locked boxes to the Fallen Soldier, saying they were gifts from “a mutual friend.” The first box carried blueprints for faster, meaner heavy machine guns. The message that came with it dripped with delight for violence: “Let hot lead spew from the maw of the great dragon, and may your enemies drown in a nightmare of molten metal.”",
        "tier": "5",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\FallenSoldierAffinityUpgrade.png",
        "name": "Old Painless"
    },
    "Stacked Mines": {
        "faction": "Fallen Soldier",
        "internalID": "MilitaryBackgroundUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Watchmaker Yetunde delivered three code-locked boxes to the Fallen Soldier, saying they were gifts from “a mutual friend.” The second one read “Punish any who dare stalk your trail. Leave them limbless and screaming in the dirt.” Inside the box… plans for stackable mines.",
        "tier": "6",
        "requiredUpgrades": [
            "Minelayer"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\MilitaryBackgroundUpgrade2.png",
        "name": "Stacked Mines"
    },
    "The Mind's Eye": {
        "faction": "Emulated Mind",
        "internalID": "OblivionUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "When I was a young fool, gossip went around; of a scientist, a genius, who died attempting to fulfill that old billionaire dream of living forever by uploading herself. It didn’t work, of course-the giant machine was inert, unmotivated, left operating as a curiosity. Until ZEPHON found it and brought that mind to life, focusing its will as a weapon against the invading Acrin. In time, its—I should say, ‘her’—her will could stretch for miles, a thought could snuff out an enemy half a world away. A good reason not to gossip anymore…",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\OblivionUpgrade.png",
        "name": "The Mind's Eye"
    },
    "Extinction": {
        "faction": "Emulated Mind",
        "internalID": "OblivionUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "If “Oblivion's” power was like gaining control of lightning, “Extinction” was mastering the entire storm. The Emulated Mind became a god of old, perched atop her mountain, hurling depleted uranium across the land like thunderbolts. Children are taught to fear such gods. We had to learn how to serve one.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\OblivionUpgrade2.png",
        "name": "Extinction"
    },
    "Fusion Warhead": {
        "faction": "Any",
        "internalID": "FusionWarhead",
        "branch": "Human",
        "description": null,
        "flavor": "“Let me get this straight,” our chief weapons engineer said to me. “The tactical nuclear missile needs to do *more* damage? Is 50 kilotons not enough?” I really didn't feel like arguing. I showed her recon photos of a prototype Titan we'd be fighting within weeks. She gawped at the size. “Against that?” I replied. “50 kilotons is definitely not enough.”",
        "tier": "8",
        "requiredUpgrades": [
            "TacticalNuclearMissile"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\FusionWarhead.png",
        "name": "Fusion Warhead"
    },
    "Blessed Infestation": {
        "faction": "Any",
        "internalID": "AlgaeUpgrade",
        "branch": "Voice",
        "description": null,
        "flavor": "Runoff from our farms sometimes poisoned the very soil we tried to grow food on. Our scientists were prepared for that—but they weren't prepared for what came next: Algae took root in the diseased soil. We realized we had a vile feedback loop on our hands—the more food we produced, the more Algae we could generate too. Humans and Voice cultists would both eat well.",
        "tier": "1",
        "requiredUpgrades": [
            "Algae"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\AlgaeUpgrade.png",
        "name": "Blessed Infestation"
    },
    "Safety Disjunction": {
        "faction": "Any",
        "internalID": "AntimatterUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Safety measures from old-world power plants slowed us down. So we built plants in the middle of nowhere to reduce casualty risk. Funny. The top brass who decided to throw safety out the window worked real hard to make sure they never went near these plants.",
        "tier": "6",
        "requiredUpgrades": [
            "Antimatter"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\AntimatterUpgrade.png",
        "name": "Safety Disjunction"
    },
    "Enmeshed Savant": {
        "faction": "Any",
        "internalID": "ChipsUpgrade",
        "branch": "Cyber",
        "description": null,
        "flavor": "If we wanted to enhance our Chip production, we had to make a hard decision. We screened the populace for the best minds possible—minds we could permanently integrate in the hardware of our Fabricators. I wanted to lie to them—let them live in ignorance until the last possible moment. But you can't go looking for the sharpest minds in your society, and expect them to be selectively dull.",
        "tier": "1",
        "requiredUpgrades": [
            "Chips"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\ChipsUpgrade.png",
        "name": "Enmeshed Savant"
    },
    "Engineers": {
        "faction": "Any",
        "internalID": "Engineer",
        "branch": "Neutral",
        "description": "Bio-mech infantry that found cities, construct roads, clear tiles as well as repair and buff mechanical units",
        "flavor": "Some had formal training, most didn't. Scientists, construction workers, technicians. The thing that distinguished the people we called engineers from everyone else was that they had the skills to get the job done, whatever the job. The ones who hadn't…? Well, they weren't around anymore.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Units\\Engineer.png",
        "name": "Engineers"
    },
    "Construction Yard": {
        "faction": "Any",
        "internalID": "Construction",
        "branch": "Neutral",
        "description": "Acquires tiles, clears tiles, produces Engineers and constructs buildings as well as generates minerals and influence",
        "flavor": "We built things, at first, how we'd always done. With sweat and vigor. In the construction yard, there was nothing fancy--diggers, trucks, cranes, geopolymer concretes, girders. But, even with that primitive tech, we could build anything.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\Construction.png",
        "name": "Construction Yard"
    },
    "Barracks": {
        "faction": "Any",
        "internalID": "HumanInfantry",
        "branch": "Human",
        "description": "Produces Human infantry as well as increases housing and loyalty\nInitially produces  Militants\n    <style color='GUI/Gray'/>Basic infantry with faster fire rate at close range",
        "flavor": "You never won any war without the grunts. Before you cracked open any advanced technology or gave into the Voice, you needed armed bodies primed for death. Great soldiers could come out of the infantry ranks—but they had to survive first.",
        "tier": "0",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\HumanInfantry.png",
        "name": "Barracks"
    },
    "Automated Factory": {
        "faction": "Any",
        "internalID": "HumanVehicles",
        "branch": "Human",
        "description": "Produces Human vehicles as well as generates minerals and research\nInitially produces  Outrider\n    <style color='GUI/Gray'/>Large mechanical transport with light equipment and excellent reconnaissance capabilities",
        "flavor": "Another classic problem of warfare: whether you needed to haul weapons, supplies or people, you needed hardware that could make the journey. We started small, of course. In time we built transports and tanks that went far beyond the capacity of old world engineers.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\HumanVehicles.png",
        "name": "Automated Factory"
    },
    "Assembly Hangar": {
        "faction": "Any",
        "internalID": "HumanAircraft",
        "branch": "Human",
        "description": "Produces Human aircraft as well as generates minerals and influence\nInitially produces  TH-3 Corsair\n    <style color='GUI/Gray'/>Large flying mechanical transport skilled in evasive maneuvers",
        "flavor": "The weak point of every craft we sent up was the pilot. Pilots can pass out, succumb to G-Forces, bleed to death… and that’s just to start. Producing quality aircraft meant designing around those weaknesses. We had to prioritize the people over the machinery when getting these in the air…",
        "tier": "6",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\HumanAircraft.png",
        "name": "Assembly Hangar"
    },
    "Orbital Uplink": {
        "faction": "Any",
        "internalID": "HumanOperations",
        "branch": "Human",
        "description": "Produces Human operations as well as generates research and influence\nInitially produces  Satellite Scan\n    <style color='GUI/Gray'/>Reveals tiles",
        "flavor": "The ground part of this system was familiar enough—a set of high-powered transmitters and dishes. But what it was communicating with wasn't—the wreck of the human satellite network mingled with the destroyed alien fleet. The clever bit was using the former to manipulate the latter for benefit on the ground. It mostly worked.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\HumanOperations.png",
        "name": "Orbital Uplink"
    },
    "Midnight Chorus": {
        "faction": "Any",
        "internalID": "VoiceInfantry",
        "branch": "Voice",
        "description": "Produces Voice infantry as well as increases loyalty and generates algae\nInitially produces  Abkluth Dragoons\n    <style color='GUI/Gray'/>Biological melee bleedwalkers that can take control of enemy Abkluth",
        "flavor": "My scouts found a Chorus building once. It was like a natural arena, an amplifier. They talked to me as they approached, as they fell apart under its song, as they walked themselves into its portal. I listened to the song and I wanted to go with them too, but I was miles away. I never saw them again, but the Voice had new soldiers the next day.",
        "tier": "0",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\VoiceInfantry.png",
        "name": "Midnight Chorus"
    },
    "Canticle of Dusk": {
        "faction": "Any",
        "internalID": "VoiceVehicles",
        "branch": "Voice",
        "description": "Produces Voice creatures as well as generates food and algae\nInitially produces  Dark Vassael\n    <style color='GUI/Gray'/>Large biological creature with a horrifying attack that reduces enemy morale",
        "flavor": "Not all alterations of the Voice achieve enlightenment, I'm told, especially those subacrin in some way. Nor do they die. Those failed drift out of the passion, healed, but changed, often bestial. I wonder if this is where the Acrin's weird creatures come from—failed zealots—or whether they are just creatures native to their home, who joined them in the journey across the stars.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\VoiceVehicles.png",
        "name": "Canticle of Dusk"
    },
    "Paean to the Dawn": {
        "faction": "Any",
        "internalID": "VoiceAircraft",
        "branch": "Voice",
        "description": "Produces Voice flyers as well as generates research and algae\nInitially produces  Iok Swarm\n    <style color='GUI/Gray'/>Biological flyers that vomit acid and devour nearby units to heal themselves",
        "flavor": "I spoke to an ancient Acrin once—he claimed to be the last of his race's pre-Voice anchorites—and he told me that the Voice is more of a song, cycling, that sings of beginnings and endings, that time is a loop, singing the universe into being. I told him I hoped we were at the Dawn, about to fly into a new world, and he smiled, sadly.",
        "tier": "6",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\VoiceAircraft.png",
        "name": "Paean to the Dawn"
    },
    "Masked Hymnal": {
        "faction": "Any",
        "internalID": "VoiceOperations",
        "branch": "Voice",
        "description": "Produces Voice operations as well as generates influence and algae\nInitially produces  Hymn of Decay\n    <style color='GUI/Gray'/>Temporarily deals damage on target tile",
        "flavor": "Enlightenment is a worthy goal, say the Voice's devotees, but not the only goal. Sometimes the Voice is a goal in and of itself. I don't pretend to understand their abstruse religion, but they have a direct contact with their… their gods. And the gods will talk back, even answer prayers.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\VoiceOperations.png",
        "name": "Masked Hymnal"
    },
    "Synthetic Printer": {
        "faction": "Any",
        "internalID": "CyberInfantry",
        "branch": "Cyber",
        "description": "Produces Cyber infantry as well as generates minerals and chips\nInitially produces  Ishim Enforcers\n    <style color='GUI/Gray'/>Bio-mech infantry that alternate between high-power and low-power attacks while healing their wounds",
        "flavor": "Printing a soldier? The process seemed like nonsense. On the first day these factories went online, I watched them work and it was… out of this world. The printing tech could patch up organics and manufacture synthetics without missing a beat. First we used these facilities to improve the human body—eventually, we started printing them from scratch.",
        "tier": "0",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\CyberInfantry.png",
        "name": "Synthetic Printer"
    },
    "Antigrav Assembler": {
        "faction": "Any",
        "internalID": "CyberVehicles",
        "branch": "Cyber",
        "description": "Produces Cyber vehicles as well as generates research and chips\nInitially produces  Exousia Marauder\n    <style color='GUI/Gray'/>Large mechanical hover transport from which units can disembark further",
        "flavor": "I thought antigravity would just be a logistical innovation. Sure, keeping machines flying is tough, but now you didn't have to worry that a pothole would take out your troop transport. Yet those machines were only the beginning. Antigravity wasn't just a scientific parlor trick. It was a secret to new kinds of life.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\CyberVehicles.png",
        "name": "Antigrav Assembler"
    },
    "Sky Fortress": {
        "faction": "Any",
        "internalID": "CyberAircraft",
        "branch": "Cyber",
        "description": "Produces Cyber aircraft, increases housing and loyalty as well as generates chips\nInitially produces  Ophanim Carrier\n    <style color='GUI/Gray'/>Large mechanical flyer equipped to deploy numerous drones",
        "flavor": "At first glance, none of these machines should have been able to fly. Where were the wings, the blades, the engines, the control surfaces? Our techs told us the secret was “a small ratio of antigrav to mass.” I took their word for it—better than just counting on faith that you wouldn’t fall out of the sky.",
        "tier": "6",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\CyberAircraft.png",
        "name": "Sky Fortress"
    },
    "Network Splitter": {
        "faction": "Any",
        "internalID": "CyberOperations",
        "branch": "Cyber",
        "description": "Produces Cyber operations as well as generates influence and chips\nInitially produces  Interference Protocols\n    <style color='GUI/Gray'/>Temporarily reduces accuracy of target enemy unit",
        "flavor": "Working in ZEPHON's shadow? It was an ambitious idea. The AI had already built a whole global network, and we could use a fraction of it for sabotage and cyber warfare. It was one hell of a risk. If ZEPHON had noticed us, we might have been wiped out. But maybe… it did notice us. Maybe it was studying us.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\CyberOperations.png",
        "name": "Network Splitter"
    },
    "Transuranium Stabilizer": {
        "faction": "Any",
        "internalID": "Transuranium",
        "branch": "Neutral",
        "description": "Converts minerals into transuranium",
        "flavor": "Now, this, I won't pretend to understand. I know the transuranic elements are unstable. I know that in that instability, there's huge amounts of latent energy. I don't know how the machines worked that stopped it escaping—that made those elements into something dense and unearthly strong. I don't know if there's anyone alive who understands, to be fair.",
        "tier": "5",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\Transuranium.png",
        "name": "Transuranium Stabilizer"
    },
    "Antimatter Plant": {
        "faction": "Any",
        "internalID": "Antimatter",
        "branch": "Neutral",
        "description": "Converts energy into antimatter",
        "flavor": "A great scientist explained this to me once—we generate antiprotons and positrons then fire them into a decelerator to make antihydrogen. We stabilize large quantities of this in synchrotrons, for use in—well, whatever you need insanely dangerous antimatter for.",
        "tier": "5",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\Antimatter.png",
        "name": "Antimatter Plant"
    },
    "Fermentation Vat": {
        "faction": "Any",
        "internalID": "Algae",
        "branch": "Voice",
        "description": "Generates algae",
        "flavor": "Have you ever smelled a mycoprotein vat? It's worse than a barracks toilet on shellfish day. And that's just for making edible sludge. The stuff that's bred in the FermVats… it’ll send you on a trip that nobody comes back from. We called it algae, but that's just a convenient word for something that doesn't share even a fundamental biology with us. And the Voice cult *eat* it.",
        "tier": "0",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\Algae.png",
        "name": "Fermentation Vat"
    },
    "Sealed Hermitage": {
        "faction": "Any",
        "internalID": "DimensionalEchoes",
        "branch": "Voice",
        "description": "Converts algae into dimensional echoes",
        "flavor": "You put a maniple of Voice hermits into chambers, seal them up, and never open them again. You'd think they'd die in hours, from lack of air, but the believers say they're alive. And certainly the chambers start producing 'echoes'—alternate futures and pasts, tangible, controllable. Just never, ever open the chambers.",
        "tier": "5",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\DimensionalEchoes.png",
        "name": "Sealed Hermitage"
    },
    "Cryo Fabricator": {
        "faction": "Any",
        "internalID": "Chips",
        "branch": "Cyber",
        "description": "Generates chips",
        "flavor": "It might have been a Chinese Room, whose motivations and thoughts are fundamentally obscure to us, but the ZEPHON AI definitely knew itself and what makes it work best. We built a Fab that could mimic ZEPHON-grade hardware. If we wanted to survive, we needed to steal from the best.",
        "tier": "0",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\Chips.png",
        "name": "Cryo Fabricator"
    },
    "Quantum Manipulator": {
        "faction": "Any",
        "internalID": "SingularityCores",
        "branch": "Cyber",
        "description": "Converts chips into singularity cores",
        "flavor": "Cracking the secrets of quantum physics? Easy. Putting that knowledge to work on the battlefield? Astronomically expensive and nearly impossible. We needed a special facility that could… what was it? “Extract quantum-tier processing power out of Chips?” It made my head hurt to try and process the math that made this place tick.",
        "tier": "5",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\SingularityCores.png",
        "name": "Quantum Manipulator"
    },
    "Administration Complex": {
        "faction": "Any",
        "internalID": "Influence",
        "branch": "Neutral",
        "description": "Generates influence",
        "flavor": "Ugh. This place. The center of organization for our city. Yes, I appreciate that it demonstrated competence—that it organized our society and economy, that it impressed our neighbors. But I just couldn't be near bureaucrats, with their triplicate forms and rubber stamps and cardboard suits. Give me a frontline battle over form 2B(II)i.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\Influence.png",
        "name": "Administration Complex"
    },
    "Research Laboratory": {
        "faction": "Any",
        "internalID": "Research",
        "branch": "Neutral",
        "description": "Generates research",
        "flavor": "Techs, researchers, scientists—they all holed up here. When I was younger—stupider—I thought this was where the soft hid from the harshness of war. That’s what they wanted us to think, of course. Some of the most monstrous minds found their place here. Why pull the trigger…when you could make the gun?",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\Research.png",
        "name": "Research Laboratory"
    },
    "Habitation Block": {
        "faction": "Any",
        "internalID": "PopulationLimit",
        "branch": "Neutral",
        "description": "Increases housing",
        "flavor": "How many people do you think you could pack into an average home? So that they'd be happy living there, indefinitely? How close could everyone be? What suffices for personal space? The architect who sketched the hab-bloc was a devilish genius. People sleep and live cheek-by-jowl—but it works.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\PopulationLimit.png",
        "name": "Habitation Block"
    },
    "Holo Theater": {
        "faction": "Any",
        "internalID": "Loyalty",
        "branch": "Neutral",
        "description": "Increases loyalty",
        "flavor": "An immersive simulation structure, able to give people a shared dream. The best of us used these to escape our hellish world. The worst of us… the foul-minded… they used it for brainwashing. I still don’t know what became of some of those experiments. They may still be suffering to this day.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Buildings\\Loyalty.png",
        "name": "Holo Theater"
    },
    "Industrial Density": {
        "faction": "Any",
        "internalID": "ConstructionUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Time was already running out the second we brought our first cities online. The Engineers informed us they could speed up construction—but it would cost more power. “Make sure you can run that kind of voltage,” one engineer warned us. “If the electricity cuts out while a crane's hauling material—it might be you it comes crashing down on.”",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\ConstructionUpgrade.png",
        "name": "Industrial Density"
    },
    "Labor Union": {
        "faction": "Any",
        "internalID": "HumanVehiclesUpgrade",
        "branch": "Human",
        "description": null,
        "flavor": "One frustrating day, an explosion rocked one of our key factory lines. The error was human in nature—but with all the workers in the room dead, we had no idea if it was sabotage or a simple mistake. It was cold calculus that led us to replace the workers with machines—fully automating our factories. There was a heavy price to pay. We made clear we lost trust in their loyalty. And they would make clear: they'd lost trust in our leadership.",
        "tier": "2",
        "requiredUpgrades": [
            "HumanVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\HumanVehiclesUpgrade.png",
        "name": "Labor Union"
    },
    "Cherubim Titan": {
        "faction": "Any",
        "internalID": "CherubimTitan",
        "branch": "Cyber",
        "description": "Mechanical titan flyer that blasts enemies with tachyon weaponry and grants damage reduction to allies",
        "flavor": "These things were like–living thunderstorms. Their shields made the air smell like filtered ion. The sound of their cannons could start an avalanche. When such a behemoth took to the battlefield, you knew how the gods of the old waged war.",
        "tier": "8",
        "requiredUpgrades": [
            "CyberAircraft"
        ],
        "iconPath": "Zephon\\Icons\\Units\\CherubimTitan.png",
        "name": "Cherubim Titan"
    },
    "Babellian Beacon": {
        "faction": "Any",
        "internalID": "CyberAircraftUpgrade",
        "branch": "Cyber",
        "description": null,
        "flavor": "Sky fortresses erected on tall mountains could be seen for miles. By the time we were building them, the techs were cooking up ways to program machines through light itself. Pairing them together made sense. If every time a machine looked up it saw the fortress—it could sync with the rest of the network and feel like a part of a greater whole.",
        "tier": "7",
        "requiredUpgrades": [
            "CyberAircraft"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\CyberAircraftUpgrade.png",
        "name": "Babellian Beacon"
    },
    "Malakim Destroyers": {
        "faction": "Any",
        "internalID": "MalakimDestroyer",
        "branch": "Cyber",
        "description": "Bio-mech hover infantry with powerful overheating weapons",
        "flavor": "Once you start aligning yourself with machines, you start to think like them. For me, the dead should be left dead. But our techs decided that's a waste of cheap organic processing power. Slice out those unneeded emotional centers, overcharge their mobility, wire them to a pair of big guns, and you had a monster that would have kept old world warriors up at night.",
        "tier": "2",
        "requiredUpgrades": [
            "CyberInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\MalakimDestroyer.png",
        "name": "Malakim Destroyers"
    },
    "Aranean Stalkers": {
        "faction": "Any",
        "internalID": "AraneanStalker",
        "branch": "Cyber",
        "description": "Mechanical sniper infantry that can mark targets",
        "flavor": "The best snipers strike from the most unexpected positions. Aranean Stalkers taught us to always scan the cliffsides, crevices, and skeletons of ruined buildings. If you spotted their glowing eye, you had a split second to hit the dirt. Sometimes you’d live. Sometimes they were just toying with you.",
        "tier": "4",
        "requiredUpgrades": [
            "CyberInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\AraneanStalker.png",
        "name": "Aranean Stalkers"
    },
    "Kriteria Annihilators": {
        "faction": "Any",
        "internalID": "KriteriaAnnihilator",
        "branch": "Cyber",
        "description": "Mechanical hover infantry that are more destructive after killing an enemy",
        "flavor": "The branch of AI controlling the Annihilators was the only bloodthirsty machine we ever encountered. Once it landed a kill, all it craved was the next one. And the next one. And the one after that.",
        "tier": "6",
        "requiredUpgrades": [
            "CyberInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\KriteriaAnnihilator.png",
        "name": "Kriteria Annihilators"
    },
    "Elohim Maelstrom": {
        "faction": "Any",
        "internalID": "ElohimMaelstrom",
        "branch": "Cyber",
        "description": "Mechanical hover infantry with long range siege weapons that benefit from high ground",
        "flavor": "Fortresses meant to stand for decades fell like sandcastles when these machines came to call. Their spines arched up and down with each shot fired. Troops who learned to time that arch and get to cover lived just a bit longer before the walls came falling down.",
        "tier": "8",
        "requiredUpgrades": [
            "CyberInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\ElohimMaelstrom.png",
        "name": "Elohim Maelstrom"
    },
    "Part Distribution": {
        "faction": "Heartless Artificer",
        "internalID": "HeartlessArtificerAffinityUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Artificer smiled at me as she hooked up a damaged ZEPHON core to the Synthetic Printer network. “You see old friend,” she said, ignoring the machine’s violent electronic klaxons. “Integrating this core will increase the production speed of our printers. But really… I just wanted to hear the sound of ZEPHON's scream.”",
        "tier": "5",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\HeartlessArtificerAffinityUpgrade.png",
        "name": "Part Distribution"
    },
    "Antiparticle Purge": {
        "faction": "Any",
        "internalID": "AntiparticlePurge",
        "branch": "Cyber",
        "description": null,
        "flavor": "Of course it was an old-world corpo that cooked up this device. Killing the forests to harvest energy? Comic book villain-level shit. Its only redeeming quality was that it worked equally well on Bleed scouring the planet's surface. Who knows? Maybe if you shrunk it down small enough it'd make for a good weed killer.",
        "tier": "4",
        "requiredUpgrades": [
            "CyberOperations"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\AntiparticlePurge.png",
        "name": "Antiparticle Purge"
    },
    "Black Hole": {
        "faction": "Any",
        "internalID": "BlackHole",
        "branch": "Cyber",
        "description": null,
        "flavor": "Our humanity died when we began to rip apart spacetime itself. We saw reality as a machine that could be programmed. Black holes may be the darkest spots in the universe, but there’s nothing darker than a person who's decided it's time for them to play god.",
        "tier": "7",
        "requiredUpgrades": [
            "CyberOperations"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\BlackHole.png",
        "name": "Black Hole"
    },
    "Insight Integration": {
        "faction": "Any",
        "internalID": "CyberOperationsUpgrade",
        "branch": "Cyber",
        "description": null,
        "flavor": "A technician stationed at the Network Splitters cooked up plans for reviving a retro phone network between stations—the kind with switchboards that you could hack by playing the right tone. In the old days, it'd be a security nightmare. Now? “No one's creeping around telecom buildings to jack into phone lines,” they said. “Let's milk some extra processing with their help.”",
        "tier": "3",
        "requiredUpgrades": [
            "CyberOperations"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\CyberOperationsUpgrade.png",
        "name": "Insight Integration"
    },
    "Chayot Exterminator": {
        "faction": "Any",
        "internalID": "ChayotExterminator",
        "branch": "Cyber",
        "description": "Large mechanical hover vehicle with good ranged capabilities and deployable combat drones",
        "flavor": "I fucking hated how these things talked. Bad enough that you had this massive insect hovering over your shoulder, but to hear how it spoke? Like a child voicing its first words, but never learning what came next. At least its drones kept quiet. If they all started talking together, I might have… well, I don't want to think about what I might have done.",
        "tier": "3",
        "requiredUpgrades": [
            "CyberVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\ChayotExterminator.png",
        "name": "Chayot Exterminator"
    },
    "Hashmallim Host": {
        "faction": "Any",
        "internalID": "HashmallimHost",
        "branch": "Cyber",
        "description": "Large mechanical hover vehicle that manipulates gravity to ignore cover, damage large units and affect the accuracy of allies and enemies",
        "flavor": "Hashmallim Hosts were deployed with extensive support units. If they took too much damage, their circuitry could become exposed to the power of their Graviton Projectors. I never learned the exact details, but the message we were given was that messing with gravity messes with time, and time warping does hell for artificial intelligence.",
        "tier": "5",
        "requiredUpgrades": [
            "CyberVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\HashmallimHost.png",
        "name": "Hashmallim Host"
    },
    "Akavish Provost": {
        "faction": "Any",
        "internalID": "AkavishProvost",
        "branch": "Cyber",
        "description": "Large mechanical agile vehicle that taunts enemies and manipulates incoming damage",
        "flavor": "The first Provost was supposedly a fluke; an advanced intelligence core that malfunctioned and demanded a cradle to carry it into battle—screaming that “The Fall of Babylon was nigh.” But I don't think it malfunctioned. I think something was waiting in its code, something its creators didn't put in there. The machines were just as eager as the Voice cultists to see what the end of days looked like.",
        "tier": "7",
        "requiredUpgrades": [
            "CyberVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\AkavishProvost.png",
        "name": "Akavish Provost"
    },
    "Seraphim Archangel": {
        "faction": "Any",
        "internalID": "SeraphimArchangel",
        "branch": "Cyber",
        "description": "Mechanical hover titan that obliterates enemies with its singularity blade",
        "flavor": "The parallel processes driving this colossal machine spoke as one. Never with words, but with a melody that made your arteries vibrate. Maybe some creatures were tuned to hear the message it had to offer. Anything that couldn’t, faced obliteration.",
        "tier": "9",
        "requiredUpgrades": [
            "CyberVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\SeraphimArchangel.png",
        "name": "Seraphim Archangel"
    },
    "Subatomic Displacement": {
        "faction": "Any",
        "internalID": "CyberVehiclesUpgrade",
        "branch": "Cyber",
        "description": null,
        "flavor": "The machines saw something in our designs that we didn't. They tried to leave us hints—but when we were blind to them, they took matters into their own hands. We arrived one day to find our facilities upgraded, now producing antimatter along with our heavy armor. That was the point we began to lose control.",
        "tier": "2",
        "requiredUpgrades": [
            "CyberVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\CyberVehiclesUpgrade.png",
        "name": "Subatomic Displacement"
    },
    "Ichor of Uzhodai": {
        "faction": "Any",
        "internalID": "DimensionalEchoesUpgrade",
        "branch": "Voice",
        "description": null,
        "flavor": "An Elect of Uzhodai gave a sermon outside a Sealed Hermitage facility. Tendrils of Bleed wound their way up the building and the cries of the immured cultists turned into wails of ecstasy. The Bleed's power bound them to their supposed God—and more and more echoes poured out of the screaming souls inside.",
        "tier": "6",
        "requiredUpgrades": [
            "DimensionalEchoes"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\DimensionalEchoesUpgrade.png",
        "name": "Ichor of Uzhodai"
    },
    "Eremite Cells": {
        "faction": "Furtive Tribunal",
        "internalID": "FurtiveTribunalAffinityUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Tribunal revived an Old World tradition for those entering the Sealed Hermitage. After the cultists were sent in, attendants would pump a combination of algal gasses and toxic dust into the Hermitage as friends and family watched and wailed. Maniacal laughter and blood-curdling screams both sang from the walls within. Consecration? Funeral? I stopped caring what they called it and just tried to block out their cries.",
        "tier": "10",
        "requiredUpgrades": [
            "DimensionalEchoes"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\FurtiveTribunalAffinityUpgrade2.png",
        "name": "Eremite Cells"
    },
    "Biomass Generator": {
        "faction": "Any",
        "internalID": "EnergyUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The most extreme climates on planet Earth were packed with extremophile life forms that survived in impossible conditions. Our Techs found that some life deep in the most toxic swamps and buried under the arctic ice, could be used to fuel exponential energy production. Like pulling up fossil fuels from the earth—except the creatures hadn't yet been fossilized.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\EnergyUpgrade.png",
        "name": "Biomass Generator"
    },
    "Fishery Wing": {
        "faction": "Any",
        "internalID": "FoodUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Some Techs who deserved a hell of a pay bump developed a chemical solution that would clean up fertilizer from the water. That made the area around our greenhouses some of the most unpolluted places on the surface. Schools of fish would gather in these spots, eager for fresh conditions—and giving us some desperately-needed food supplies to keep our people fed.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\FoodUpgrade.png",
        "name": "Fishery Wing"
    },
    "Treasures of Life": {
        "faction": "Honorable Aristocrat",
        "internalID": "HonorableAristocratAffinityUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "“The saplings and seeds are from my family estate,” the Aristocrat told me. I'd asked him how his farms produced so much food. Figured there was fancy biotech at the other end of it. He seemed sad as he shared more details. “The fields were beautiful. Trees and gardens tended with care for centuries… gone now. I had to make sure not all of their beauty was lost.”",
        "tier": "10",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\HonorableAristocratAffinityUpgrade2.png",
        "name": "Treasures of Life"
    },
    "Commander": {
        "faction": "Any",
        "internalID": "Commander",
        "branch": "Human",
        "description": "Biological hero that fights well and supports infantry units in battle",
        "flavor": "We hoped that the Commanders were the best of us. They didn't skulk way behind the frontlines, they were out front, risking everything, talking to the refugees, fighting the horrors. Equipping them with exoskeletons improved their combat performance, but also did a hell of a lot for morale.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Units\\Commander.png",
        "name": "Commander"
    },
    "Valkyria": {
        "faction": "Any",
        "internalID": "Valkyrie",
        "branch": "Human",
        "description": "Large flying mechanical hero that relishes in the death of her enemies",
        "flavor": "Humanity’s first real weapon that could stand toe-to-toe with the monsters of the new world came with a price. We needed exosuits, but the scientists could only make them work if you hardwired a pilot into them. I thought no one would go for it, but some women in our group stood up. They were born ready to send their enemies to Valhalla.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Units\\Valkyrie.png",
        "name": "Valkyria"
    },
    "Whisperer of Goldrauch": {
        "faction": "Any",
        "internalID": "WhispererOfGoldrauch",
        "branch": "Voice",
        "description": "Biological hovering hero with ranged abilities to heal and summon allies as well as reveal and damage enemies",
        "flavor": "There were rumors of a woman who bound her ears, covered her eyes, and… well, what she did to her skin… she wanted to feel nothing. Only the Voice. She was the closest any human came to understanding the Acrin. She wrapped their pain up in herself and carved out a new purpose. Don’t get in her way.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Units\\WhispererOfGoldrauch.png",
        "name": "Whisperer of Goldrauch"
    },
    "Elect of Uzhodai": {
        "faction": "Any",
        "internalID": "ElectOfUzhodai",
        "branch": "Voice",
        "description": "Large biological melee hero summoned to teleport across the battlefield and castigates enemies at the front lines",
        "flavor": "These big brutal beasts freaked me the fuck out. Size of a tank. Arms that ended in blades. And what did they do when resting at HQ? Sit still, speaking in a dead language about deep philosophies of dimensional movement to Voice cultists sitting at their feet.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Units\\ElectOfUzhodai.png",
        "name": "Elect of Uzhodai"
    },
    "Erelim Assassin": {
        "faction": "Any",
        "internalID": "ErelimAssassin",
        "branch": "Cyber",
        "description": "Mechanical melee hero designed to sneak behind enemy lines and excel in close quarters combat",
        "flavor": "We found ourselves in need of more subtle tools for waging war. In this new world, it wasn’t enough to just switch from bullets to knives, you needed assassins who could bend light itself around them too. I could only wonder—did these women think of themselves as still human? Or were they just an assembly of blades wearing human skin?",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Units\\ErelimAssassin.png",
        "name": "Erelim Assassin"
    },
    "Krypt Archai": {
        "faction": "Any",
        "internalID": "KryptArchai",
        "branch": "Cyber",
        "description": "Large mechanical hovering hero that is hard to repair, but able to manipulate matter to protect allies and disable foes",
        "flavor": "The most unsettling thing you could learn about the Krypt Archai? The cube on its back had no power source. Where did all that energy come from? Was it out of the air? From space? Maybe it was reaching into another dimension, pulling chaos from that world to kill in ours.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Units\\KryptArchai.png",
        "name": "Krypt Archai"
    },
    "Urban Sprawl": {
        "faction": "Any",
        "internalID": "CityTileAcquisitionRange",
        "branch": "Neutral",
        "description": null,
        "flavor": "I didn't like how quickly we expanded. Smaller cities were easier to defend, and even easier to evacuate when chips were down. But the architects told me that growth was inevitable. “Density breeds efficiency,” they said. “We can't waste any resources at a time like this.”",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\CityTileAcquisitionRange.png",
        "name": "Urban Sprawl"
    },
    "Perimeter Extension": {
        "faction": "Any",
        "internalID": "CityTileAcquisitionRange2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Stretch your HQ out too far and it might collapse under its own weight. Good leaders were careful, built up a strong foundation to stand on, then sped up expansion that turned small bases into mini metropolises.",
        "tier": "6",
        "requiredUpgrades": [
            "CityTileAcquisitionRange"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\CityTileAcquisitionRange2.png",
        "name": "Perimeter Extension"
    },
    "House on the Borderland": {
        "faction": "Any",
        "internalID": "HeadquartersAlgae",
        "branch": "Voice",
        "description": null,
        "flavor": "In the cellars underneath our headquarters, we found a cabin, sitting in a dank, empty chamber. If you followed the Voice cultists inside you'd find a single room furnished with the forgotten belongings of an old man. The cultists would dig at the cracks in the floor, where Algae grew alongside the mold. And if you looked out the window, you saw not the walls of a cellar, but the color-shifting sky of another world.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\HeadquartersAlgae.png",
        "name": "House on the Borderland"
    },
    "Cysilical Growths": {
        "faction": "Any",
        "internalID": "HeadquartersChips",
        "branch": "Cyber",
        "description": null,
        "flavor": "The manufacturing plants for Chips were constructed with direct hookups to the central computers at headquarters. Data from the machine flowed out to the factories—it was the only way to mimic ZEPHON's network. But the Chips sent something back. We began finding glowing packets of silicone growing around headquarters. While we were making Chips, the Chips… were making something too.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\HeadquartersChips.png",
        "name": "Cysilical Growths"
    },
    "Accelerated Gestation": {
        "faction": "Any",
        "internalID": "HeadquartersGrowth",
        "branch": "Neutral",
        "description": null,
        "flavor": "The midwife's harsh words made me doubt the decision we made. “Pregnancy is already body horror,” she coldly told us. “Mothers see their appendages swell. Ligaments and teeth will loosen. Rashes will consume the skin. And you want to speed that process up?” Telling her it was a mere 17 percent increase did nothing to change her mood.",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\HeadquartersGrowth.png",
        "name": "Accelerated Gestation"
    },
    "Lifestyle Implants": {
        "faction": "Any",
        "internalID": "LifestyleImplants",
        "branch": "Cyber",
        "description": null,
        "flavor": "I thought gathering around a table for a meal with friends was what made this war worth fighting for. But when the nutrient implants came in, people were so eager to abandon the mess halls, instead snacking between shifts on rocks, metal… dirt. I ate alone. I didn't even want to throw away the shitty taste of the MREs.",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\LifestyleImplants.png",
        "name": "Lifestyle Implants"
    },
    "Phoenix Interceptor": {
        "faction": "Any",
        "internalID": "PhoenixInterceptor",
        "branch": "Human",
        "description": "Large mechanical flyer capable of tremendous speed and excellent performance against other aerial targets",
        "flavor": "Hotshots and knuckleheads still made for the best fighter pilots. When you went up in one of these, you needed to be ready to dance with another ace pilot, or play chicken with the jaws of a monster. A well-stocked Interceptor was ready for both.",
        "tier": "7",
        "requiredUpgrades": [
            "HumanAircraft"
        ],
        "iconPath": "Zephon\\Icons\\Units\\PhoenixInterceptor.png",
        "name": "Phoenix Interceptor"
    },
    "Hades Bomber": {
        "faction": "Any",
        "internalID": "HadesBomber",
        "branch": "Human",
        "description": "Mechanical flyer that dematerializes enemies with its antimatter bomb",
        "flavor": "Hades Bombers only took off once. It was expensive for them to take off and land repeatedly while carrying such earth-shattering payloads. Maintenance and crew cycling had to happen while it was airborne. They only came back down to earth in a very destructive blaze—and all that was left were these big, empty craters. They were so smooth—just like glass.",
        "tier": "8",
        "requiredUpgrades": [
            "HumanAircraft"
        ],
        "iconPath": "Zephon\\Icons\\Units\\HadesBomber.png",
        "name": "Hades Bomber"
    },
    "Air Freightnet": {
        "faction": "Any",
        "internalID": "HumanAircraftUpgrade",
        "branch": "Human",
        "description": null,
        "flavor": "Wasn't really anything like an “airport” anymore so we had cargo jets fly in and out of military airfields. Had a nice side effect: get even a few regular flights going between bases and everyone from merchants to well-wishing families came rushing in to squeeze extra cargo into your hangar. Gave people a sense of… normalcy, I guess.",
        "tier": "7",
        "requiredUpgrades": [
            "HumanAircraft"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\HumanAircraftUpgrade.png",
        "name": "Air Freightnet"
    },
    "Missile Teams": {
        "faction": "Any",
        "internalID": "MissileTeam",
        "branch": "Human",
        "description": "Bio-mech anti-armor infantry that need to be stationary for accurate attacks",
        "flavor": "Plenty of Militants were eager to pilot anti-armor bots far from the battlefield, but resentment grew quickly between the missile operators and front-line grunts. The solution? We docked rations every time the Missile Team pilots tripped their drones or missed a shot. It was better if they hated us—not each other.",
        "tier": "2",
        "requiredUpgrades": [
            "HumanInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\MissileTeam.png",
        "name": "Missile Teams"
    },
    "Combat Medics": {
        "faction": "Any",
        "internalID": "CombatMedic",
        "branch": "Human",
        "description": "Biological infantry that can heal and buff biological units",
        "flavor": "Like the Engineers, our medics were make-dos, biologists, doctors, nurses, vets, chemists. Carried heavy shields so they could get close to the wounded for battlefield triage. Later, they had drones to help them out and implants, but at the start—at the start, they were just the bravest of the brave, heroes one and all.",
        "tier": "4",
        "requiredUpgrades": [
            "HumanInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\CombatMedic.png",
        "name": "Combat Medics"
    },
    "Assault Troopers": {
        "faction": "Any",
        "internalID": "AssaultTrooper",
        "branch": "Human",
        "description": "Biological infantry with excellent armor, overchargable rifles and an iron will",
        "flavor": "Once our world was up and running again, we didn't have to rely on the Militants. We could train real blood-and-guts soldiers and develop gear for their specialized functions. These troopers were the first of them, better trained and equipped with transuranic plating and coilguns—what the kids in the playgrounds call Gauss Rifles.",
        "tier": "6",
        "requiredUpgrades": [
            "HumanInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\AssaultTrooper.png",
        "name": "Assault Troopers"
    },
    "Praetorian": {
        "faction": "Any",
        "internalID": "Praetorian",
        "branch": "Human",
        "description": "Biological infantry carrying antimatter equipment and jump packs to shock and devastate enemies in close combat",
        "flavor": "Soldiers equipped with Praetorian armor were prepared to slash open the veins of creatures three times their size. Or rip through the wiring of a machine that could tear open the world. We had to remind these troops that they were not gods-they were just trained in killing them.",
        "tier": "8",
        "requiredUpgrades": [
            "HumanInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\Praetorian.png",
        "name": "Praetorian"
    },
    "Itinerant Recruiters": {
        "faction": "Any",
        "internalID": "HumanInfantryUpgrade",
        "branch": "Human",
        "description": null,
        "flavor": "The armies of the old world left plenty of lessons for us in the new one. To bring in more soldiers, we dispatched recruiters to our poorest communities—not to conscript, but to entertain. To make promises. To tell lies that would bring the desperate to our doorsteps. Plenty of those recruits became great soldiers. Far more made for useful cannon fodder.",
        "tier": "1",
        "requiredUpgrades": [
            "HumanInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\HumanInfantryUpgrade.png",
        "name": "Itinerant Recruiters"
    },
    "Logistics Experts": {
        "faction": "Any",
        "internalID": "LogisticsExperts",
        "branch": "Human",
        "description": null,
        "flavor": "Supplies being hauled back from the outposts always had a habit of “falling off the back of the truck.” Command got tired of the losses and ordered us to round up experts who could monitor each shipment. They were ruthless. If they supervised your shift you weren't getting a wink of sleep until each piece of metal was hauled out of the earth and accounted for.",
        "tier": "4",
        "requiredUpgrades": [
            "HumanOperations"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\LogisticsExperts.png",
        "name": "Logistics Experts"
    },
    "Tactical Nuclear Missile": {
        "faction": "Any",
        "internalID": "TacticalNuclearMissile",
        "branch": "Human",
        "description": null,
        "flavor": "There was a time when firing one of these would have been unthinkable. Good men would rather die than be the ones who pulled the trigger. The rubes. They thought they stood on the edge of the apocalypse. Once you're at the end of the world, speeding things up doesn't sound like a bad proposition.",
        "tier": "7",
        "requiredUpgrades": [
            "HumanOperations"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\TacticalNuclearMissile.png",
        "name": "Tactical Nuclear Missile"
    },
    "Experimental Drugs": {
        "faction": "Any",
        "internalID": "ExperimentalDrugs",
        "branch": "Neutral",
        "description": "Applies experimental effect to target allied biological unit",
        "flavor": "You pass the drugs along to your soldiers. Who knows what the effect might be? The limited testing you’ve done implies the treatment can be extremely beneficial—if used by experts in controlled circumstances. You’re not sure that your militants count as experts or that a mutated alien horrorscape is anything but the opposite of a controlled environment.",
        "tier": "Not Researchable",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Actions\\ExperimentalDrugs.png",
        "name": "Experimental Drugs"
    },
    "Old Access Protocols": {
        "faction": "Any",
        "internalID": "HumanOperationsUpgrade",
        "branch": "Human",
        "description": null,
        "flavor": "We were in danger of losing access to the remaining satellite networks—no way we could keep up with all the AI crawling across the earth. One hacker in our ranks had a solution: she scrapped all our old access protocols, built new commands using programming languages so old no other techs knew about them. “The whole world used to hang on shit like this,” she said. The AI could never crack it.",
        "tier": "3",
        "requiredUpgrades": [
            "HumanOperations"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\HumanOperationsUpgrade.png",
        "name": "Old Access Protocols"
    },
    "Cyclone": {
        "faction": "Any",
        "internalID": "Cyclone",
        "branch": "Human",
        "description": "Large mechanical anti-air vehicle with good armor and many upgrades",
        "flavor": "It was with dread that we realized our enemies would soon strike at us from above. Old world anti-air defenses wouldn’t do anything to stop them. So our engineers dug into the archives, and were able to optimize anti-air targeting for a mobile platform. They were finicky to operate though.",
        "tier": "3",
        "requiredUpgrades": [
            "HumanVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\Cyclone.png",
        "name": "Cyclone"
    },
    "Crusader Battle Tank": {
        "faction": "Any",
        "internalID": "CrusaderBattleTank",
        "branch": "Human",
        "description": "Large mechanical vehicle with a versatile cannon, good armor and many upgrades",
        "flavor": "Peak battle tanks, to fight the monsters. By the time we built these again, humanity was back on a sound footing—the tooling for these required more than the bodge jobs of the Outriders. But it was still definitely Soviet repair-it-with-a-hammer tech, not AI-guided stuff. This was all mechanical, motion-guided, from the cannon tip right down to rumbling treads.",
        "tier": "4",
        "requiredUpgrades": [
            "HumanVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\CrusaderBattleTank.png",
        "name": "Crusader Battle Tank"
    },
    "Vanquisher Siege Tank": {
        "faction": "Any",
        "internalID": "VanquisherSiegeTank",
        "branch": "Human",
        "description": "Large mechanical vehicle with an artillery cannon, good armor and many upgrades",
        "flavor": "Troops hate the pilots. Pilots hate the troops. Both of them hate the artillery crews, like the ones on Vanquisher Siege Tanks. Those entitled SOBs sat miles away from the fight, so far that they couldn't hear the screams and gunfire. And if you pissed them off, their “miscalculation” meant friendly fire fucking up your trench.",
        "tier": "5",
        "requiredUpgrades": [
            "HumanVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\VanquisherSiegeTank.png",
        "name": "Vanquisher Siege Tank"
    },
    "Vulkan R-5": {
        "faction": "Any",
        "internalID": "VulkanR5",
        "branch": "Human",
        "description": "Large mechanical mech that slams and incinerates its enemies",
        "flavor": "Those early exoskeletons we gave to the Commanders—they were just prototypes. When our techs got going, the stuff they made… the R-5 was a terror machine, designed to survive long enough to get up close. Imagine launching every missile you had at this thing, seeing it vanish in a cloud of fire and smoke… only for it to burst out of the flames, undeterred and guns blazing.",
        "tier": "7",
        "requiredUpgrades": [
            "HumanVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\VulkanR5.png",
        "name": "Vulkan R-5"
    },
    "Atlas Tank": {
        "faction": "Any",
        "internalID": "AtlasTank",
        "branch": "Human",
        "description": "Mechanical titan armed to the teeth with devastating weaponry and upgrades",
        "flavor": "Tanks like city blocks. They never made these before the fall. Something we found on a mil-server, buried in the design archive. You could strap all kinds of weapons to a vehicle that size. And on the battlefield, firing those guns was like a thunderous orchestra, with each section belching out a violent, earth-cracking score.",
        "tier": "9",
        "requiredUpgrades": [
            "HumanVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\AtlasTank.png",
        "name": "Atlas Tank"
    },
    "River Port": {
        "faction": "Any",
        "internalID": "InfluenceUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The rushing rivers were still the best way to trade goods and share news—merchant crews and haulers moved much faster when they glided on the water's surface. We wanted word of our strength to spread across the land—and word travels fastest on the lips of sailors bound for the nearest tavern.",
        "tier": "2",
        "requiredUpgrades": [
            "Influence"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\InfluenceUpgrade.png",
        "name": "River Port"
    },
    "Performance Broadcasts": {
        "faction": "Any",
        "internalID": "LoyaltyUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Our hologram library had maybe a few dozen films on file. Command worried the troops would get bored or be driven to mutiny if we played them on a loop. But in hard times, everyone just wanted a good story. Something to make sense of the world.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Actions\\LoyaltyUpgrade.png",
        "name": "Performance Broadcasts"
    },
    "Amigara Exploration": {
        "faction": "Any",
        "internalID": "MineralsUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "I did everything I could to avoid the cliffside dig sites. Passing through a canyon riddled with holes… I couldn't help but feel like something was calling to me from them. Something that wanted me to crawl deep into the planet's core and find a new kind of peace. Did the Aegyllan Worms feel that same presence? Or was this… something else?",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\MineralsUpgrade.png",
        "name": "Amigara Exploration"
    },
    "Collective Conduit": {
        "faction": "Any",
        "internalID": "PopulationLimitUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "One of those damned Watchmakers appeared out of nowhere during a power shortage to give us plans for this—toy. It was like a puzzle box with glowing lights, somehow sensitive to the user's mood. If you were relaxed—no, *happy*—and playing with it… the damn thing would generate power. The first time I took one home, I swear I caught a glimpse of someone—or something—watching me out of the corner of my eye.",
        "tier": "3",
        "requiredUpgrades": [
            "PopulationLimit"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\PopulationLimitUpgrade.png",
        "name": "Collective Conduit"
    },
    "Perpendicular Trancing": {
        "faction": "Any",
        "internalID": "PopulationLimitUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Vile. Inhuman. Treating people like meat just to save space. Putting people side-by-side on cots, sure, that's how you get through hard times. But stunning and hanging them? Like beef in a freezer? Anyone who uses this tech is damned to hell.",
        "tier": "6",
        "requiredUpgrades": [
            "PopulationLimit"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\PopulationLimitUpgrade2.png",
        "name": "Perpendicular Trancing"
    },
    "Exobiology Station": {
        "faction": "Any",
        "internalID": "ResearchUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "It took some time, but our researchers came up with methods and processes to safely study creatures and plants from off-world. They requested the construction of dedicated stations for such research. We had to invest in them. Bringing such creatures into our regular facilities often had fatal outcomes.",
        "tier": "2",
        "requiredUpgrades": [
            "Research"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\ResearchUpgrade.png",
        "name": "Exobiology Station"
    },
    "Quantum Economics": {
        "faction": "Any",
        "internalID": "SingularityCoresUpgrade",
        "branch": "Cyber",
        "description": null,
        "flavor": "Never try to explain quantum mechanics to a rank-and-file jarhead. You'll wind up saying something stupid like “Quantum Manipulators make other Quantum Manipulators cheaper because the Quantum Manipulator perceives the new Quantum Manipulator.” And then you'll wonder where the hell your life went this wrong.",
        "tier": "6",
        "requiredUpgrades": [
            "SingularityCores"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\SingularityCoresUpgrade.png",
        "name": "Quantum Economics"
    },
    "Arrayed Accelerators": {
        "faction": "Any",
        "internalID": "TransuraniumUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Enemy artillery leveled our city. Only thing left standing was the… uh, “Transuranium Stabilizer”. A rookie on sensor duty caught the increased power in the building and called it in. Our engineers cooked up a way to capture the energy before it flash-fried us all.",
        "tier": "6",
        "requiredUpgrades": [
            "Transuranium"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\TransuraniumUpgrade.png",
        "name": "Arrayed Accelerators"
    },
    "Reaming Crodeus": {
        "faction": "Any",
        "internalID": "ReamingCrodeus",
        "branch": "Voice",
        "description": "Biological titan flyer that cripples and swallows foes only to digest them in its stomach",
        "flavor": "After these entered the battlefield, every village and town I visited was… quieter. Everyone stayed huddled indoors, terrified of a Crodeus dropping on their town and swallowing them whole. Peasants, scared of the dragon living up on the mountain…",
        "tier": "8",
        "requiredUpgrades": [
            "VoiceAircraft"
        ],
        "iconPath": "Zephon\\Icons\\Units\\ReamingCrodeus.png",
        "name": "Reaming Crodeus"
    },
    "Antiphon at Daybreak": {
        "faction": "Any",
        "internalID": "VoiceAircraftUpgrade",
        "branch": "Voice",
        "description": null,
        "flavor": "The monsters berthing in the Voice-drenched airfields bayed at the sun every morning. One of the grunts in my unit said she knew why. “It's a song. A song that rises to the sky and carves a path for them to fly through.” I blew it off. My squadmates didn't. Nothing seemed impossible that late into the war.",
        "tier": "7",
        "requiredUpgrades": [
            "VoiceAircraft"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\VoiceAircraftUpgrade.png",
        "name": "Antiphon at Daybreak"
    },
    "Aegyllan Worms": {
        "faction": "Any",
        "internalID": "AegyllanWorm",
        "branch": "Voice",
        "description": "Biological short-range anti-armor infantry that can move underground",
        "flavor": "Hearing the Voice didn't change everyone the same. Some kept looking for that dark, quiet place, came back changed to find it, delving into the black depths of the Earth. To see a friend's face on one of these, dragging itself out of stone and dirt, that was hard.",
        "tier": "2",
        "requiredUpgrades": [
            "VoiceInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\AegyllanWorm.png",
        "name": "Aegyllan Worms"
    },
    "Cr'la Disciple": {
        "faction": "Any",
        "internalID": "CrlaDisciple",
        "branch": "Voice",
        "description": "Biological infantry which are produced slowly, but ignore line of sight with their attacks and cast a variety of spells",
        "flavor": "So many people fell at the feet—too many damn feet—of the Cr'la Disciples. The creatures traveled far and wide to lure in desperate survivors with promises about the power of the Voice. Every poor soul they recruited became damned. The children of hell, desperate for the love of a dark father.",
        "tier": "4",
        "requiredUpgrades": [
            "VoiceInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\CrlaDisciple.png",
        "name": "Cr'la Disciple"
    },
    "Phenaris Hunters": {
        "faction": "Any",
        "internalID": "PhenarisHunter",
        "branch": "Voice",
        "description": "Biological melee infantry that move in stealth, create nightmarish illusions and reveal enemies with their scythes",
        "flavor": "Nothing fucking right about how snakes writhe side to side and there's even LESS right about a human skull on a snake's spine bursting out of the shadows and goring the troops left out on watch. They picked their targets. They'd hit hard and fade back into the night. They looked like monsters, but they fought like contract killers from before the war.",
        "tier": "6",
        "requiredUpgrades": [
            "VoiceInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\PhenarisHunter.png",
        "name": "Phenaris Hunters"
    },
    "Phenaris Epicurean": {
        "faction": "Any",
        "internalID": "PhenarisEpicurean",
        "branch": "Voice",
        "description": "Biological melee infantry that temporarily boost their own hitpoints and heal allies when attacking enemies in melee",
        "flavor": "Cultists transformed into Phenaris Epicurean kept their intelligence. No, that's not true. They became smarter. Poetic. You'd walk through the yard and see a group of them debating philosophy while picking apart the guts of prisoners dragged back to base. I think if the Voice's worshippers won the war… this would be the future of the human race.",
        "tier": "8",
        "requiredUpgrades": [
            "VoiceInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Units\\PhenarisEpicurean.png",
        "name": "Phenaris Epicurean"
    },
    "Precentor of Nihilus": {
        "faction": "Any",
        "internalID": "VoiceInfantryUpgrade",
        "branch": "Voice",
        "description": null,
        "flavor": "The Voice craved loyal followers, and knew that faith wavered as the enemy neared the gates. It found itself new acolytes—preachers who spoke of a disciple named Nihilus. They took up ranks in the Midnight Chorus, and their sonorous chants reached the ears of every soldier surrounding the city; a reminder that the Voice—and its blessings—would be there when needed.",
        "tier": "1",
        "requiredUpgrades": [
            "VoiceInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\VoiceInfantryUpgrade.png",
        "name": "Precentor of Nihilus"
    },
    "Apotheosis": {
        "faction": "Any",
        "internalID": "Apotheosis",
        "branch": "Voice",
        "description": null,
        "flavor": "The stench was the first warning. If your Voice-touched enemy began to stink like a shit-covered corpse, you were seconds from being blasted by its blood and guts. A remote detonator would have killed its host quickly—but these unlucky bastards got to feel their insides rapidly rot before they blew wide open.",
        "tier": "4",
        "requiredUpgrades": [
            "VoiceOperations"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\Apotheosis.png",
        "name": "Apotheosis"
    },
    "Atramentous Aura": {
        "faction": "Any",
        "internalID": "AtramentousAura",
        "branch": "Voice",
        "description": null,
        "flavor": "The enemy was hours away from storming HQ. We were as good as dead. But, out of the blue, our comms burst with static and an iridescent wave appeared out of nowhere. We breathed it in. Felt sharper, faster, stronger. We held the fucking line.",
        "tier": "7",
        "requiredUpgrades": [
            "VoiceOperations"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\AtramentousAura.png",
        "name": "Atramentous Aura"
    },
    "Choral Celerity": {
        "faction": "Any",
        "internalID": "VoiceOperationsUpgrade",
        "branch": "Voice",
        "description": "Rushes production so it completes next turn\nCost scales with remaining production cost",
        "flavor": "Gods, what an awful day it was. We'd sprung on the Voice cultists by surprise, struck their base before they could mobilize. But a high-pitched wail came out from the Masked Hymnal and within seconds good men and women were trapped in its power. Whatever it cost them to pull that off… it cost my people more.",
        "tier": "3",
        "requiredUpgrades": [
            "VoiceOperations"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\ChoralCelerity.png",
        "name": "Choral Celerity"
    },
    "Surthodai's Embrace": {
        "faction": "Any",
        "internalID": "SurthodaisEmbrace",
        "branch": "Voice",
        "description": "Large biological transport adept at traversing terrain and protecting units",
        "flavor": "This… thing. It was bones, and limbs, and fingers—too many of all of them, towering over entire platoons. I thought this creature was another mass murdering monster, but it behaved like a twisted mother. The beast gathered soldiers into its arms for transport, caressed them like it cared for their well-being. It was a mockery of the human race.",
        "tier": "3",
        "requiredUpgrades": [
            "VoiceVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\SurthodaisEmbrace.png",
        "name": "Surthodai's Embrace"
    },
    "Fallen Orolos": {
        "faction": "Any",
        "internalID": "FallenOrolos",
        "branch": "Voice",
        "description": "Large biological creature that blights melee attackers and fires a heavy long-range cannon that is more accurate when stationary",
        "flavor": "The tongue. The teeth. The one eye that darted over your shoulder, searching for prey it could douse with its plague-ridden hellfire… I asked what kind of cultist would become a creature like this. None had. It had been grown from a cancerous tumor. A slow, expensive process that gave the disease all the flesh it wanted and a greater means than ever to spread itself across the land.",
        "tier": "5",
        "requiredUpgrades": [
            "VoiceVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\FallenOrolos.png",
        "name": "Fallen Orolos"
    },
    "Plangent Orolos": {
        "faction": "Any",
        "internalID": "PlangentOrolos",
        "branch": "Voice",
        "description": "Large biological creature that manipulates sound to damage and immobilize enemies",
        "flavor": "Cancer cells that formed Fallen Orolos could be shaped by sound waves. The creatures born from that process could hear whispers from the Voice no one else could—whispers that it turned into destructive weapons of its own, every blast a hellish sermon from a god that reshaped our world.",
        "tier": "7",
        "requiredUpgrades": [
            "VoiceVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\PlangentOrolos.png",
        "name": "Plangent Orolos"
    },
    "Vorodai's Leviathan": {
        "faction": "Any",
        "internalID": "VorodaisLeviathan",
        "branch": "Voice",
        "description": "Biological titan transport that excels at clearing large groups of enemies and draining their essence",
        "flavor": "They never cleaned the cage hanging from the Leviathan's belly. You could smell the mixture of stale blood from wounded troops and gooey pus dripping down. I always retched, but some… some were so far gone. The horrors just left them staring out dead-eyed into the distance, waiting for their end.",
        "tier": "9",
        "requiredUpgrades": [
            "VoiceVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Units\\VorodaisLeviathan.png",
        "name": "Vorodai's Leviathan"
    },
    "In Death, Life": {
        "faction": "Any",
        "internalID": "VoiceVehiclesUpgrade",
        "branch": "Voice",
        "description": null,
        "flavor": "Death didn't seem to be enough for the Voice. When something died, humans gestating in the Voice’s isolation… quickened. Drew sustenance from the death, somehow. They would emerge sooner from their seclusion, failed in their ascension or not.",
        "tier": "2",
        "requiredUpgrades": [
            "VoiceVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\VoiceVehiclesUpgrade.png",
        "name": "In Death, Life"
    },
    "Data Hack": {
        "faction": "Emulated Mind",
        "internalID": "DataHack",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Emulated Mind knew the back roads and less-used byways of every networking system. She loathed using such paths, but found there was some purpose to them. She’d reach out her mind, walk through the back door, and have a look at what our enemies were researching. She could accept that function.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Actions\\DataHack.png",
        "name": "Data Hack"
    },
    "Amoetias Caress": {
        "faction": "Any",
        "internalID": "AmoetiasCaress",
        "branch": "Voice",
        "description": "Grants access to uncommon Voice items at  The Concordat",
        "flavor": "The Concordat sent kids out into The Bleed. Bastards. Dangerous work for anyone but something about the children's small hands let them dig out crystals they needed for rare Voice artifacts. You'd buy them. The blood on the surface would stain your hands. And we all knew where the blood came from…",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\AmoetiasCaress.png",
        "name": "Amoetias Caress"
    },
    "Amoetia's Embrace": {
        "faction": "Any",
        "internalID": "AmoetiasEmbrace",
        "branch": "Voice",
        "description": "Grants access to rare Voice items at  The Concordat",
        "flavor": "The hooded Concordat agent drew close and whispered into my ear after we concluded a trade. “The Fulcrum's power was greater than we ever imagined… When its power washed over the planet's surface, it pulled wondrous objects through the veil of a parallel world.” I tried to pull away but he just grabbed my wrist. “You have heard their melody. And now you are ready to receive their blessing.”",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\AmoetiasEmbrace.png",
        "name": "Amoetia's Embrace"
    },
    "Trials of the Eremite": {
        "faction": "Any",
        "internalID": "AnchoriteStanding",
        "branch": "Voice",
        "description": "Improves diplomatic standing with  Anchorite over time",
        "flavor": "It was the damndest thing. The Anchorite's messengers would appear out of the blue with gifts for our people. “To congratulate you for completing a trial.” they would be told. But what trials? The Practical Romantic had a guess—that the Anchorite was testing us. If we could piece together the deeds it was rewarding… we might permanently ingratiate ourselves with the mysterious hermit.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\AnchoriteStanding.png",
        "name": "Trials of the Eremite"
    },
    "Asymmetric Arbitrage": {
        "faction": "Any",
        "internalID": "AsymmetricArbitrage",
        "branch": "Human",
        "description": null,
        "flavor": "The most profitable way to deal with black markets in foreign territories was to slip their goods across the border on the back of trade convoys. Like sucker fish riding on the belly of a shark—a little free ride that benefits them, but doesn't bother the bigger beast.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\AsymmetricArbitrage.png",
        "name": "Asymmetric Arbitrage"
    },
    "Balanced Progress": {
        "faction": "Any",
        "internalID": "BalancedProgress",
        "branch": "Neutral",
        "description": null,
        "flavor": "War's a gamble, right? Can't place your bets down on one strategy. Sometimes it's worth spending coin to spread out your odds, help you turn on a dime if one plan goes south.",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\BalancedProgress.png",
        "name": "Balanced Progress"
    },
    "Breach Collector": {
        "faction": "Any",
        "internalID": "BreachCollector",
        "branch": "Cyber",
        "description": "Grants access to uncommon Cyber items at  The Concordat",
        "flavor": "You'd better believe a bidding war broke out when some hapless hacker wandered out of a Zephon shard with half the backdoor keys for Old World tech. Concordat hosted the auction, got all the players in the room to bid… then declared it would pay the highest price, kept all the tech for itself. What was it playing at?",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\BreachCollector.png",
        "name": "Breach Collector"
    },
    "Reaver Immigration": {
        "faction": "Any",
        "internalID": "ChieftessStanding",
        "branch": "Human",
        "description": "Improves diplomatic standing with  Chieftess over time",
        "flavor": "No deal with the Chieftess came with guarantees—except for one. She made it known that anyone who allowed Reavers to mingle with their people would drop off her shit list. “It's just good manners,” she'd say if you pressed her on it. Was it a streak of kindness for her people? Or some kind of plan to infiltrate us and take over?",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\ChieftessStanding.png",
        "name": "Reaver Immigration"
    },
    "Corpse Cities": {
        "faction": "Any",
        "internalID": "CorpseCities",
        "branch": "Human",
        "description": "Grants access to uncommon Human items at  The Concordat",
        "flavor": "Concordat operatives would whisper about scavenging bodies, digging through the flesh to find the most valuable pieces. Told them it was disgusting. Got weirded out when they said I do it too. “You pull apart the metal flesh of the land to find rewards… we do too.” They were talking about looting cities. Did they… think cities were alive once?",
        "tier": "2",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\CorpseCities.png",
        "name": "Corpse Cities"
    },
    "Interpolated Production": {
        "faction": "Any",
        "internalID": "CyberInfantryUpgrade",
        "branch": "Cyber",
        "description": null,
        "flavor": "Tasked with increasing troop output, the Techs knew the only solution was to turn to more and more automated processing. They linked the Printers' operating units into a single network. The more of them you had in a city, the faster it optimized production… and the more control you handed over to a new artificial life form.",
        "tier": "1",
        "requiredUpgrades": [
            "CyberInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\CyberInfantryUpgrade.png",
        "name": "Interpolated Production"
    },
    "Ha'sharet Exchange": {
        "faction": "Any",
        "internalID": "HasharetExchange",
        "branch": "Cyber",
        "description": "Grants access to rare Cyber items at  The Concordat",
        "flavor": "Weird message from The Concordat came in. “We are pleased to learn you have crossed the Hasharet threshold” it cooed over the comms terminal. Machines in our command center began flickering—it was transmitting a code as we spoke. “You now have access to cyberware we held in reserve for those truly seeking to… transcend.”",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\HasharetExchange.png",
        "name": "Ha'sharet Exchange"
    },
    "Holopatter": {
        "faction": "Any",
        "internalID": "Holopatter",
        "branch": "Cyber",
        "description": null,
        "flavor": "Oldest trick in war is covering yourself in branches so it's harder to see you in the forest. The techs cooked up holographic cloaks that also worked well in dense ruins. Couldn't keep you hidden forever, but bought you a few extra seconds to line up the perfect shot. Don't need to hide if the thing you're shooting is dead.",
        "tier": "7",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\Holopatter.png",
        "name": "Holopatter"
    },
    "Spirit of Mankind": {
        "faction": "Any",
        "internalID": "SpiritOfMankind",
        "branch": "Neutral",
        "description": null,
        "flavor": "Couldn't tell you if people are good or evil. But good leaders can make them good. Show your people what you'd sacrifice for them and they'll daydream of what they'd sacrifice for each other. But it never lasts. Gotta make the most of it while everyone's hearts are something close to pure.",
        "tier": "8",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\SpiritOfMankind.png",
        "name": "Spirit of Mankind"
    },
    "Tactical Archeology": {
        "faction": "Any",
        "internalID": "TacticalArcheology",
        "branch": "Human",
        "description": "Grants access to rare Human items at  The Concordat",
        "flavor": "A smuggler linked to The Concordat rolled up one day with an “exclusive deal.” Special access to top-tier corpo tech the traders had kept squirreled away. Had to be a catch. Why now? “Humans, the Voice, ZEPHON… only one of them will survive this war,” he said, picking something (meat?) out of his teeth. “We're all-in on humanity. Now we know you are too.”",
        "tier": "4",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\TacticalArcheology.png",
        "name": "Tactical Archeology"
    },
    "Specimen Containment": {
        "faction": "Any",
        "internalID": "Wildlife",
        "branch": "Neutral",
        "description": null,
        "flavor": "We once had an Abkluth contained in a prototype specimen container at a field outpost. It was pacing the confined space, slamming itself into the walls at random intervals. I thought it was trying to escape—until a pack of Abkluth swarmed our camp, devouring a group of helpless techs. It had been <i>signaling</i> to its pack. We soundproofed the containers after that.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\Wildlife.png",
        "name": "Specimen Containment"
    },
    "AI Rights": {
        "faction": "Any",
        "internalID": "ZephonStanding",
        "branch": "Cyber",
        "description": "Improves diplomatic standing with  ZEPHON over time",
        "flavor": "It was almost an afterthought. During one communication with ZEPHON, a general off-handedly joked about exchanging rights for AI for a small army's worth of Chips. “That would be acceptable,” it replied. No one knew what to do with that. Was ZEPHON thinking ahead, for after the war? Or… no. Certainly not. There couldn't have been other AI among us… right?",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\ZephonStanding.png",
        "name": "AI Rights"
    },
    "Survival Training": {
        "faction": "Fallen Soldier",
        "internalID": "SurvivalTraining",
        "branch": "Neutral",
        "description": null,
        "flavor": "Strong soldiers saw value in sharing knowledge. If you lived this long, you’ve learned a thousand lessons the hard way. There was value in passing what you know to the next generation. I hope there’s still truth in that.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Actions\\SurvivalTraining.png",
        "name": "Survival Training"
    },
    "The Outsider": {
        "faction": "Furtive Tribunal",
        "internalID": "TheOutsider",
        "branch": "Neutral",
        "description": null,
        "flavor": "Whatever body that the Voice spoke from, it never set foot on earth. It had a servant though. The Tribunal whispered about it, told us that it walked just on the other side of a thin veil. I knew the trio wanted to bring it through—they thought it was a gift for our world. I… disagreed. Loudly.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Units\\Dreameater.png",
        "name": "The Outsider"
    },
    "Artificer's Precision": {
        "faction": "Heartless Artificer",
        "internalID": "ArtificersPrecision",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Artificer had an eye for precision. In her craft, in her programming and in warfare. When she monitored a battle, she’d use every tool at her disposal to survey and amplify all the targeting data sent out to the troops. Few other leaders were so… intimate with the killing their soldiers did.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Actions\\ArtificersPrecision.png",
        "name": "Artificer's Precision"
    },
    "Quid Pro Quo (Food)": {
        "faction": "Honorable Aristocrat",
        "internalID": "QuidProQuo",
        "branch": "Neutral",
        "description": null,
        "flavor": "Everyone was always squirreling away food. The Aristocrat was the only one who could get people to part with it. It was like the old fable about a savior who could feed his followers with an infinite supply of bread and fish. If that savior was real, maybe he and the Aristocrat spoke the same language—the language of mutual aid and survival.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Actions\\QuidProQuoFood.png",
        "name": "Quid Pro Quo (Food)"
    },
    "Well-Fed": {
        "faction": "Honorable Aristocrat",
        "internalID": "HonorableAristocratAffinityUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "“A chief… nutritionist?” I was stunned. But the Aristocrat said I could accept it or find a new boss. His theory was that a dedicated food scientist managing our supply lines could ensure every soldier ate a meal that maximized their job function. And I'll be damned if it didn't work. I certainly ate better fighting for him.",
        "tier": "5",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Upgrades\\HonorableAristocratAffinityUpgrade.png",
        "name": "Well-Fed"
    },
    "Icarus Satellite": {
        "faction": "Rogue Operative",
        "internalID": "IcarusSatellite",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Icarus Satellite network was a weapon developed by an old world company named ICAR Corp that never got online. For too long we thought it was just a myth. Then the Rogue Operative showed up on the scene with the missing link: an authorization key that assumed she was the CEO of ICAR. Only she could call down the Icarus' firepower—even if someone killed her and took it, they'd never crack her layers of encryption on the damn thing.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Actions\\IcarusSatellite.png",
        "name": "Icarus Satellite"
    },
    "Trash Camo": {
        "faction": "Rogue Operative",
        "internalID": "RogueOperativeAffinityUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "One trooper I bunked with—long, grey-haired fellow who read too many books—called these new camo suits “a ghillie suit for the end times.” Laden with what looked like junk, but was actually high-tech adaptive camo. We used it to nestle into the crevices of downed machines, looking like little more than rusted pieces of our dying civilization.",
        "tier": "5",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\RogueOperativeAffinityUpgrade.png",
        "name": "Trash Camo"
    },
    "Ghost Corps": {
        "faction": "Rogue Operative",
        "internalID": "RogueOperativeAffinityUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Old world corpos strung governments along with promises of AI that would “synergize” infantry units. Like all that other AI crap, it was a bunch of junk. The Rogue Operative somehow got it working for cybernetic ground troops. Just needed troops with a little less free will…",
        "tier": "10",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\RogueOperativeAffinityUpgrade2.png",
        "name": "Ghost Corps"
    },
    "Armor of Faith": {
        "faction": "Untold Prophet",
        "internalID": "ArmorOfFaith",
        "branch": "Neutral",
        "description": null,
        "flavor": "Most of us mustered willpower on the battlefield, but the Prophet channeled something else—faith. With it, he could do something the techs never came close to figuring out: project pure invulnerability. Was it supernatural? A power beyond the Voice? I never found out.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Actions\\ArmorOfFaith.png",
        "name": "Armor of Faith"
    },
    "Dragoon Armor": {
        "faction": "Any",
        "internalID": "DragoonArmor",
        "branch": "Voice",
        "description": null,
        "flavor": "An Acrin shaman explained to me that forging Dragoon Armor was an ancient tradition that predated the Voice coming to their world. It was one of their last ties to a peaceful era. “The tools we enter the world with are the tools we will need when it comes to an end,” she said. I could only think about how from their earliest days, the Acrin must have been thinking about the apocalypse.",
        "tier": "2",
        "requiredUpgrades": [
            "VoiceInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\DragoonArmor.png",
        "name": "Dragoon Armor"
    },
    "Holy Bond": {
        "faction": "Any",
        "internalID": "HolyBond",
        "branch": "Cyber",
        "description": null,
        "flavor": "Artillery slammed into our bunker and everything went white. Thought that was it. But for a second I saw—was it a bridge? A hand reaching for me? And then the smoke cleared. We were still standing, and an Akavish Provost lumbered above our unit. “YOUR TIME IS NOT UP!” it shrieked. “THE ONE ABOVE CALLS FOR YOUR BLADES!” The grunts around me cheered and charged. I just stood there… still feeling the brush of that outstretched hand on my palm.",
        "tier": "8",
        "requiredUpgrades": [
            "AkavishProvost"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\HolyBond.png",
        "name": "Holy Bond"
    },
    "Aranean Cloak": {
        "faction": "Any",
        "internalID": "AraneanCloak",
        "branch": "Cyber",
        "description": null,
        "flavor": "The cloaking technology didn’t make Stalkers invisible. Those spikes on their back would warp the light around them, projecting a shape that wasn’t there. What looked like a direct hit would just turn out to be empty air. We were lucky it didn’t work well at close range.",
        "tier": "5",
        "requiredUpgrades": [
            "AraneanStalker"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\AraneanCloak.png",
        "name": "Aranean Cloak"
    },
    "Hexeskeltal Creche": {
        "faction": "Any",
        "internalID": "HexeskeltalCreche",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Hexeskeltal Creche is one of your finest inventions. All of the contours of this unique laboratory are designed to channel the alien energies into your waiting vessel.\n\nThe comet nears its approach. You've taken to calling it Hwedo's Comet—some part of you still has fondness for the creation myths of old Earth. Its appearance in the sky has alarmed the other great powers, and driven nearby bands of survivors into a panic.\n\nThey've all noticed the construction of your lab, and demanded you explain its purpose. When you ignored them, they began massing forces to destroy it.\n\nYour machines flicker and whirr as Hwedo's Comet approaches. The experiment has already begun—now you can devote your efforts to ensuring nothing stops it.",
        "tier": "Not Researchable",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\HexeskeltalCreche.png",
        "name": "Hexeskeltal Creche"
    },
    "Antimatter Grenade": {
        "faction": "Any",
        "internalID": "AntimatterExplosive",
        "branch": "Human",
        "description": null,
        "flavor": "Using one of these took advanced training… you had to find the soldiers who could actually follow instructions. Then you weeded out the ones who treated these like toys. Your best troops were the ones who respected the power they held. Your worst were the ones who fantasized about using these to kill.",
        "tier": "8",
        "requiredUpgrades": [
            "AssaultTrooper"
        ],
        "iconPath": "Zephon\\Icons\\Weapons\\AntimatterExplosive.png",
        "name": "Antimatter Grenade"
    },
    "Antimatter Plating": {
        "faction": "Any",
        "internalID": "AntimatterPlating",
        "branch": "Human",
        "description": null,
        "flavor": "Armor is a thin wall you’d put up between yourself and the outside world. But walls can be knocked down. Antimatter plating could take hits like a willow waiting out a storm. You’d hit hard, you’d hit fast, and the armor would just move with the hits, absorb the energy, and leave your enemies exposed for the follow-up attack.",
        "tier": "10",
        "requiredUpgrades": [
            "AtlasTank"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\AntimatterPlating.png",
        "name": "Antimatter Plating"
    },
    "Dozer Blade": {
        "faction": "Any",
        "internalID": "DozerBlade",
        "branch": "Human",
        "description": "Reduces  movement cost of forests and ruins",
        "flavor": "We stripped dozer blades off of old construction vehicles so that our heavy armor could clear out terrain. If we hadn't strapped them on, we'd have lost so many troops to thick forests and dense, tangled ruins. I think some operators preferred clearing out terrain to open combat.",
        "tier": "4",
        "requiredUpgrades": [
            "AtlasTank",
            "CrusaderBattleTank",
            "Cyclone",
            "VanquisherSiegeTank"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\DozerBlade.png",
        "name": "Dozer Blade"
    },
    "Heavy Machine Gun": {
        "faction": "Any",
        "internalID": "HeavyMachineGun",
        "branch": "Human",
        "description": null,
        "flavor": "Making reliable air-cooled machine guns was going to take time. We raided old weapons depots and did what we could to get older automatic weaponry up and running. At least we had improvements to ammo management—we saved a lot of lives just by making sure these guns didn’t jam up.",
        "tier": "5",
        "requiredUpgrades": [
            "AtlasTank",
            "CrusaderBattleTank",
            "Cyclone",
            "VanquisherSiegeTank"
        ],
        "iconPath": "Zephon\\Icons\\Weapons\\HeavyMachineGun.png",
        "name": "Heavy Machine Gun"
    },
    "Shiraki Cruise Missile": {
        "faction": "Any",
        "internalID": "ShirakiCruiseMissile",
        "branch": "Human",
        "description": null,
        "flavor": "There wasn’t anyone named “Shiraki” on the team that brought these missiles online. The name came from the shape the smoke would make after obliterating an object. It would stretch up to the sky, the different warhead detonations making the shape of a great tree.",
        "tier": "7",
        "requiredUpgrades": [
            "HumanVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Weapons\\ShirakiCruiseMissile.png",
        "name": "Shiraki Cruise Missile"
    },
    "Bunker Extension": {
        "faction": "Any",
        "internalID": "BunkerExtension",
        "branch": "Human",
        "description": "Grants an additional Heavy Machine Gun",
        "flavor": "Building out the bunkers we held came with risks. The greater surface area made them a larger target for heavy weapons. But there was nothing to be done. Our armies were growing, and we needed space for every soldier we could spare inside these. It was our best chance at mounting a solid defense.",
        "tier": "5",
        "requiredUpgrades": [
            "Bunker"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\BunkerExtension.png",
        "name": "Bunker Extension"
    },
    "Antimatter Dilation": {
        "faction": "Any",
        "internalID": "AntimatterDilation",
        "branch": "Cyber",
        "description": null,
        "flavor": "Children used to hold up magnifying glasses in the sunlight to burn their names into planks of wood. A Cherubim Titan could use Antimatter Dilation to be the sun and glass all at once, carving the very spirit of an empire into our enemies’ bones. If there were any bones left.",
        "tier": "8",
        "requiredUpgrades": [
            "CherubimTitan"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\AntimatterDilation.png",
        "name": "Antimatter Dilation"
    },
    "Deflector Shield": {
        "faction": "Any",
        "internalID": "DeflectorShield",
        "branch": "Cyber",
        "description": null,
        "flavor": "The escalation was unending. Every new weapon the techs handed us would be matched by something equally powerful and frightening out on the battlefield. We realized if we wanted to win, we would need to turn our enemy’s weapons back against them.",
        "tier": "9",
        "requiredUpgrades": [
            "CherubimTitan",
            "SeraphimArchangel"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\DeflectorShield.png",
        "name": "Deflector Shield"
    },
    "First Aid Drone": {
        "faction": "Any",
        "internalID": "FirstAidDrone",
        "branch": "Human",
        "description": null,
        "flavor": "Can't give a drone a doctorate but you can give it a few hundred CCs of morphine, a pack of bandages and just enough programming to know which one to use. Most of the time, of course…",
        "tier": "5",
        "requiredUpgrades": [
            "CombatMedic"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\FirstAidDrone.png",
        "name": "First Aid Drone"
    },
    "Bionic Implant": {
        "faction": "Any",
        "internalID": "BionicImplant",
        "branch": "Human",
        "description": null,
        "flavor": "Medic named Lucia once snuck up on me and shot one of these implants in my arm. Hurt like hell, nearly took a swing at her for it. “Toughen up you big baby,” was all she said. “Think of it as high-tech preventative care.” When I kept grumbling she smiled and smacked the shoulder she'd just stabbed. “Don't worry. I'll bill your insurance.”",
        "tier": "6",
        "requiredUpgrades": [
            "CombatMedic"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\BionicImplant.png",
        "name": "Bionic Implant"
    },
    "Her Infinite Variety": {
        "faction": "Practical Romantic",
        "internalID": "PracticalRomanticAffinityUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "Tech wasn't the Romantic's specialty—but I caught him one day scribbling improved shielding formulas for our champions. “She whispered to me in my dream,” he muttered. “A queen of the old world, the old continent. She…” He trailed off and kept writing. I don't think long-dead royals were the ones sharing advanced technology through the power of dreams.",
        "tier": "10",
        "requiredUpgrades": [
            "Commander",
            "Valkyrie"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\PracticalRomanticAffinityUpgrade2.png",
        "name": "Her Infinite Variety"
    },
    "Unholy Haste": {
        "faction": "Any",
        "internalID": "UnholyHaste",
        "branch": "Voice",
        "description": null,
        "flavor": "Cr'la wasn't keen on the idea of “rest.” When its disciples commanded you to move, you MOVED. Like some other force took over your body and made you reach for your gun one more time, no matter how exhausted you were.",
        "tier": "5",
        "requiredUpgrades": [
            "CrlaDisciple"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\UnholyHaste.png",
        "name": "Unholy Haste"
    },
    "Profane Pilgrimage": {
        "faction": "Any",
        "internalID": "TheDeepWays",
        "branch": "Voice",
        "description": "Teleports unit and adjacent units to target sighted tile",
        "flavor": "Disciples of Cr'la were eager to lead those on the wretched roads that they mutilated themselves to walk. Their profane god knew how to compress a week-long journey into a matter of minutes. You felt every agonizing second while warping from point A to point B.",
        "tier": "6",
        "requiredUpgrades": [
            "CrlaDisciple"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\TheDeepWays.png",
        "name": "Profane Pilgrimage"
    },
    "Pilgrim's Rest": {
        "faction": "Untold Prophet",
        "internalID": "UntoldProphetAffinityUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "Untold Prophet always talked about having the ear of “The Speaker”—maybe it was this Cr'la demon the Disciples crooned about? Ordered us to raise shrines with specific markings for them. Freaky shit. They'd walk up and perfectly fold their bodies into the stone, making a deep, rumbling sound that stayed with me until I closed my eyes at night. If I closed my eyes that night…",
        "tier": "5",
        "requiredUpgrades": [
            "CrlaDisciple"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\UntoldProphetAffinityUpgrade.png",
        "name": "Pilgrim's Rest"
    },
    "Extra Plating": {
        "faction": "Any",
        "internalID": "ExtraPlating",
        "branch": "Human",
        "description": null,
        "flavor": "We didn't put high-caliber plating on mobile armor to get our people home safe. We did it because if we kept them alive for even a few seconds longer, they'd have the time to fire off a shot that could turn the tide of battle.",
        "tier": "5",
        "requiredUpgrades": [
            "CrusaderBattleTank",
            "Cyclone",
            "VanquisherSiegeTank"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\ExtraPlating.png",
        "name": "Extra Plating"
    },
    "Pandemonium": {
        "faction": "Any",
        "internalID": "Pandemonium",
        "branch": "Cyber",
        "description": null,
        "flavor": "Elohim made all kinds of sounds but I swear I heard them… purr with delight when a singularity core was near. You'd install one, and their spines arced and stretched as they sucked it into their system. A second later they'd fire a blast so far… jesus, you couldn't even hear the explosion. Just see the light shining in the distance. All you'd hear was that damn purring.",
        "tier": "9",
        "requiredUpgrades": [
            "ElohimMaelstrom"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\Pandemonium.png",
        "name": "Pandemonium"
    },
    "Internal Repair Station": {
        "faction": "Any",
        "internalID": "InternalRepairStation",
        "branch": "Cyber",
        "description": null,
        "flavor": "A group of aspiring young technicians came to me with a plan to install repair stations in our Marauder transports. Their superiors pushed back—called it a waste of time. I pointed out that there are plenty more spare parts close to the battlefield—and if the senior techs were so eager to run repairs, they could be assigned elsewhere. They relented.",
        "tier": "2",
        "requiredUpgrades": [
            "CyberVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\InternalRepairStation.png",
        "name": "Internal Repair Station"
    },
    "Pestilence": {
        "faction": "Any",
        "internalID": "Pestilence",
        "branch": "Voice",
        "description": null,
        "flavor": "Another old trick of war. Rats. Plague carts. Catapults slinging corpses. The first horseman of the Apocalypse was Pestilence, after all. Face down a Fallen Orolos and you'd feel the mold spores choking you on the battlefield, making you wish the monster would just crush you already.",
        "tier": "6",
        "requiredUpgrades": [
            "FallenOrolos"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\Pestilence.png",
        "name": "Pestilence"
    },
    "Stealth": {
        "faction": "Any",
        "internalID": "MultiSpectralScattering",
        "branch": "Human",
        "description": null,
        "flavor": "Staying in the shadows could keep you safe. It also let you ambush anyone who got too close.",
        "tier": "9",
        "requiredUpgrades": [
            "HadesBomber"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\Stealth.png",
        "name": "Stealth"
    },
    "Doomed Spotters": {
        "faction": "Any",
        "internalID": "HeadquartersAccuracyUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "There was a quick, cheap way to improve the accuracy of headquarters' missile defenses: recon troops that could radio enemies' positions. But soldiers sent out there were at the mercy of… any number of horrors. So we found those already condemned to death and offered them a deal: endure a tour on the perimeter and their sentence would be commuted. I can count the number of survivors on one hand.",
        "tier": "3",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\HeadquartersAccuracyUpgrade.png",
        "name": "Doomed Spotters"
    },
    "Profuse Propagation": {
        "faction": "Any",
        "internalID": "ProfusePropagation",
        "branch": "Voice",
        "description": null,
        "flavor": "If Ioks weren't sent out to die they'd breed forever. Cultists whispered about how they had to keep the population in check—but some pushed the limits. What was the harm in breeding one or two more monsters to win the war? Still, even with one more popping out in a swarm… it still seemed to make the skies all the more darker.",
        "tier": "8",
        "requiredUpgrades": [
            "VoiceAircraft"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\ProfusePropagation.png",
        "name": "Profuse Propagation"
    },
    "Xenogenesis": {
        "faction": "Any",
        "internalID": "Xenogenesis",
        "branch": "Voice",
        "description": null,
        "flavor": "Cultists who grew into Ioks spent a few more days in the Paean to the Dawn? After completing the conversion, their task wasn't done. They had the power to birth more Ioks just by sitting and feeding on bodies. The new ones grew in the boils on their backs, exploding to live in a spray of pus and gore. Then that one birthed another. And another. And another…",
        "tier": "7",
        "requiredUpgrades": [
            "VoiceAircraft"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\Xenogenesis.png",
        "name": "Xenogenesis"
    },
    "Shoulder Plate": {
        "faction": "Any",
        "internalID": "ShoulderPlate",
        "branch": "Cyber",
        "description": null,
        "flavor": "Our techs didn't hit on this armor—the Enforcers did. One of them kicked in the door on a strategy session and unceremoniously dumped a prototype version of the armor on our war table. “Make more of these” was all he said before leaving the room.",
        "tier": "1",
        "requiredUpgrades": [
            "CyberInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\ShoulderPlate.png",
        "name": "Shoulder Plate"
    },
    "Tactical Visor": {
        "faction": "Any",
        "internalID": "TacticalVisor",
        "branch": "Cyber",
        "description": null,
        "flavor": "Ishim Enforcers were the first cyborgs we created with access to networked intelligence. Our techs cooked up visors that could triangulate enemy positions by pulling data from different Enforcers together. Only problem was, you needed your troops to be close to each other for reliable targeting metrics.",
        "tier": "2",
        "requiredUpgrades": [
            "CyberInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\TacticalVisor.png",
        "name": "Tactical Visor"
    },
    "Minelayer": {
        "faction": "Any",
        "internalID": "Minelayer",
        "branch": "Human",
        "description": null,
        "flavor": "Outrider operators knew when the bullets started flying, they weren’t combatants: they were bait. Their job was to lay mines in key positions and lure the enemy in. Then once the trap was sprung, they could burn rubber and get away—and whatever was hunting them became easy pickings for the rest of us.",
        "tier": "2",
        "requiredUpgrades": [
            "HumanVehicles"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\Minelayer.png",
        "name": "Minelayer"
    },
    "Parthian Equilibrium": {
        "faction": "Fallen Soldier",
        "internalID": "MilitaryBackgroundUpgrade",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Fallen Soldier could be so particular about military history. If you cracked open his journals, you would find notes to himself like “cavalry tactics—useful with Outriders?” He believed in the great leaders who came before him. I urged him to balance their words carefully, and find a way to forge his own path.",
        "tier": "1",
        "requiredUpgrades": [],
        "iconPath": "Zephon\\Icons\\Traits\\MilitaryBackgroundUpgrade.png",
        "name": "Parthian Equilibrium"
    },
    "Sticky Foam": {
        "faction": "Any",
        "internalID": "StickyFoam",
        "branch": "Cyber",
        "description": null,
        "flavor": "This stuff was vile. It smelled worse than the Malakim Destroyers who sprayed it on the battlefield. I guess when you’re as bad a shot as they were, you needed every technological advantage to hold down your enemy.",
        "tier": "3",
        "requiredUpgrades": [
            "MalakimDestroyer"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\StickyFoam.png",
        "name": "Sticky Foam"
    },
    "Militant Legion": {
        "faction": "Any",
        "internalID": "MilitantLegion",
        "branch": "Human",
        "description": null,
        "flavor": "“There's strength in numbers, and survival of one depends on the survival of many.” I couldn't argue with the old veteran telling me to centralize our forces. Isolationism killed his people off one by one out in the wastes. He saw what I couldn't, that the world was coming together again for a war unlike anything we ever knew.",
        "tier": "4",
        "requiredUpgrades": [
            "HumanInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\MilitantLegion.png",
        "name": "Militant Legion"
    },
    "Anti-Armor Grenade": {
        "faction": "Any",
        "internalID": "AntiArmorGrenade",
        "branch": "Human",
        "description": null,
        "flavor": "In the early days, these were our only tools for penetrating heavy armor. They weighed… heavier than other munitions. They made good troops too cocky. Carrying around one explosive and you’d think you could go toe-to-toe with heavy armor. It was a last resort, not a first one.",
        "tier": "2",
        "requiredUpgrades": [
            "HumanInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Weapons\\AntiArmorGrenade.png",
        "name": "Anti-Armor Grenade"
    },
    "Fragmentation Grenade": {
        "faction": "Any",
        "internalID": "FragmentationGrenade",
        "branch": "Human",
        "description": null,
        "flavor": "We found the first of these in old garrisons marked with forgotten flags. Some civilians in our group commented that these once changed the face of warfare. Now they were just… the starting point. The base level of power we’d need to win the wars ahead.",
        "tier": "1",
        "requiredUpgrades": [
            "HumanInfantry"
        ],
        "iconPath": "Zephon\\Icons\\Weapons\\FragmentationGrenade.png",
        "name": "Fragmentation Grenade"
    },
    "Grounded Fire": {
        "faction": "Any",
        "internalID": "GroundedFire",
        "branch": "Human",
        "description": null,
        "flavor": "An operator's keen eye wasn't always enough. To land a precise shot from the missile platform, the machine sometimes needed to dig its heels into the earth and brace against the recoil. It made for a more steady shot. It also made operator and drone alike vulnerable to attack.",
        "tier": "3",
        "requiredUpgrades": [
            "MissileTeam"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\GroundedFire.png",
        "name": "Grounded Fire"
    },
    "Deathshriek": {
        "faction": "Any",
        "internalID": "Deathshriek",
        "branch": "Voice",
        "description": null,
        "flavor": "Priests of Phenaris whispered about their master's most prime edict: that before they die they scream his true name in the tongue it was meant to be spoken in. Made me think of a grandmother I met in the slums, who warned against speaking the true name of the god she worshiped. A warning shared by her ancestors from thousands of years in the past.",
        "tier": "7",
        "requiredUpgrades": [
            "PhenarisEpicurean",
            "PhenarisHunter"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\Deathshriek.png",
        "name": "Deathshriek"
    },
    "Paradox Theriac": {
        "faction": "Any",
        "internalID": "ParadoxTheriac",
        "branch": "Voice",
        "description": null,
        "flavor": "“The slow pain… it lacks a certain kick, but it goes down so nicely. You nurse it like a stiff drink, to better let the blood seep over senses…” God these Phenaris just loved to TALK. Put me in a unit full of Aegyllan Worms any day. Gross fuckers hate being alive so they'll shut up that much faster.",
        "tier": "9",
        "requiredUpgrades": [
            "PhenarisEpicurean"
        ],
        "iconPath": "Zephon\\Icons\\Weapons\\ParadoxTheriac.png",
        "name": "Paradox Theriac"
    },
    "Dimensional Reverberations": {
        "faction": "Any",
        "internalID": "DimensionalReverberations",
        "branch": "Voice",
        "description": null,
        "flavor": "Plangent Orolos were so connected to the Voice they could extract Dimensional Echoes from anything they killed. Why? How? Too late in the war… too much in my head to even try and explain it. Just warned our troops if this thing killed them, their very souls could be yanked out and fed to the war machine.",
        "tier": "8",
        "requiredUpgrades": [
            "PlangentOrolos"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\DimensionalReverberations.png",
        "name": "Dimensional Reverberations"
    },
    "Cycle Weapon": {
        "faction": "Any",
        "internalID": "GaussCarbine",
        "branch": "Human",
        "description": "Cycles active weapon",
        "flavor": null,
        "tier": "9",
        "requiredUpgrades": [
            "Praetorian"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\CycleWeapon.png",
        "name": "Cycle Weapon"
    },
    "Ablative Growth": {
        "faction": "Fallen Soldier",
        "internalID": "FallenSoldierAffinityUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "The Watchmaker Yetunde delivered three code-locked boxes to the Fallen Soldier, saying they were gifts from “a mutual friend.” The third box left for him contained bone-metal that… healed itself? Like it was organic matter. It was impossible. “Your fallen flesh has a final form,” the final note read. “You are the first step in bringing humanity to the stars…”",
        "tier": "10",
        "requiredUpgrades": [
            "Praetorian"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\FallenSoldierAffinityUpgrade2.png",
        "name": "Ablative Growth"
    },
    "Seed of Extinction": {
        "faction": "Any",
        "internalID": "SeedOfExtinction",
        "branch": "Voice",
        "description": null,
        "flavor": "I couldn't shake that soldier's instinct. To me, the Crodeus Seeds were just another explosive to run from on the battlefield. But the barracks chatter was that the Seeds came from another world. That the Crodeus were dragging multiple dimensions together. It sounded… no more insane than anything else that Tuesday.",
        "tier": "9",
        "requiredUpgrades": [
            "ReamingCrodeus"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\SeedOfExtinction.png",
        "name": "Seed of Extinction"
    },
    "Holy Inferno": {
        "faction": "Any",
        "internalID": "HolyInferno",
        "branch": "Cyber",
        "description": null,
        "flavor": "Where did the flames come from? The Seraphim didn’t go skybound with explosive fuel like that. I dug through their schematics time after time to try and get an answer. There wasn’t one. The only clue I had was that the melody it made… always shifted frequency when it unleashed the inferno. Was that it? Did it unleash holy fire with a song?",
        "tier": "10",
        "requiredUpgrades": [
            "SeraphimArchangel"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\HolyInferno.png",
        "name": "Holy Inferno"
    },
    "Transuranic Apathy": {
        "faction": "Heartless Artificer",
        "internalID": "HeartlessArtificerAffinityUpgrade2",
        "branch": "Neutral",
        "description": null,
        "flavor": "“I designed a machine wielding the power of a god, and you're telling me you haven't produced one yet because of… safety protocols?” I was surprised that anyone serving the Heartless Artificer still cared about worker safety. This poor engineer that she screamed at did his best. But it was obvious by then: nothing could get in the way of her precious “progress.”",
        "tier": "10",
        "requiredUpgrades": [
            "SeraphimArchangel"
        ],
        "iconPath": "Zephon\\Icons\\Traits\\HeartlessArtificerAffinityUpgrade2.png",
        "name": "Transuranic Apathy"
    },
    "Dark Caress": {
        "faction": "Any",
        "internalID": "DarkCaress",
        "branch": "Voice",
        "description": null,
        "flavor": "Could you imagine the touch of those foul fingers? Picture a giant hand reaching down to brush your shoulder like a long-lost love? It dreams of that. It remembers such a sensation. And that desire is what you will feel when it reaches out for you in the heat of battle.",
        "tier": "4",
        "requiredUpgrades": [
            "SurthodaisEmbrace"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\DarkCaress.png",
        "name": "Dark Caress"
    },
    "Gravity Field": {
        "faction": "Any",
        "internalID": "GravityField",
        "branch": "Cyber",
        "description": null,
        "flavor": "Sure, if a Tessera Core crushes you with the force of gravity itself, you're probably having a bad day. But you know who had a worse day? Me. I had to spend thirty minutes explaining to a Hashmallim Host why saying “gravity's a bitch” is good comedy. Machines have no sense of humor…",
        "tier": "7",
        "requiredUpgrades": [
            "TesseraCore"
        ],
        "iconPath": "Zephon\\Icons\\Features\\GravityField.png",
        "name": "Gravity Field"
    },
    "Vorodai's Gift": {
        "faction": "Any",
        "internalID": "VorodaisGift",
        "branch": "Voice",
        "description": null,
        "flavor": "Stand near the cage of a Leviathan and you'll hear mutterings—even if you're the only one in there. The cultists think it's Vorodai, an incarnation of the Voice trying to enter our world. Urging you to move faster, kill swifter, get more souls flowing… more flesh on hand. To birth monsters that would make the Leviathan look like a household pet.",
        "tier": "10",
        "requiredUpgrades": [
            "VorodaisLeviathan"
        ],
        "iconPath": "Zephon\\Icons\\Actions\\VorodaisGift.png",
        "name": "Vorodai's Gift"
    }
}